-- phpMyAdmin SQL Dump
-- version 4.2.11
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: Aug 15, 2026 at 08:21 PM
-- Server version: 5.6.21-log
-- PHP Version: 5.6.3

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `db_qa2025`
--

-- --------------------------------------------------------

--
-- Table structure for table `tb_basismain`
--

CREATE TABLE IF NOT EXISTS `tb_basismain` (
`basisMainID` int(11) NOT NULL,
  `IndicatorID` int(11) NOT NULL,
  `basisName` text COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=307 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `tb_basismain`
--

INSERT INTO `tb_basismain` (`basisMainID`, `IndicatorID`, `basisName`) VALUES
(1, 1, ' - ມີວິໄສທັດ ແລະ ພາລະກິດ \n - ຜູ້ມີສ່ວນຮ່ວມ ທັງພາຍໃນ ແລະ ພາຍນອກ ສະຖານການສຶກສາ ມີສ່ວນຮ່ວມໃນການກໍານົດວິໄສທັດ ແລະ ພາລະກິດ\n - ວິໄສທັດ ແລະ ພາລະກິດ ສອດຄ່ອງກັບຄວາມຕ້ອງການຂອງທ້ອງຖິ່ນ ແລະ ຂະແໜງການ'),
(3, 2, '- ມີຈຸດໝາຍ ຫຼື ຕົວຊີ້ວັດຜົນໄດ້ຮັບເພື່ອຕິດຕາມການຈັດຕັ້ງປະຕິບັດໃຫ້ບັນລຸຕາມວິໄສທັດ'),
(11, 5, ' - ມີຂໍ້ຕົກລົງແຕ່ງຕັ້ງສະພາທີ່ປຶກສາ \n - ມີຈໍານວນສະມາຊິກພາຍໃນ ໜ້ອຍກວ່າພາຍນອກສະຖານການສຶກສາ \n - ມີການເຄື່ອນໄຫວຕາມພາລະບົດບາດ \n - ມີຜົນໄດ້ຮັບຈາກການເຄື່ອນໄຫວເປັນຮູບປະທໍາ (ງົບປະມານທີ່ຂົນຂວາຍໄດ້, ການຮ່ວມມື, ຈໍານວນສະຖານປະກອບການທີ່ເປັນເຄືອຂ່າຍ ແລະ ອື່ນໆ) '),
(13, 6, '- ພາກສ່ວນກ່ຽວຂ້ອງມີສ່ວນຮ່ວມໃນການຕັດສິນບັນຫາທີ່ສໍາຄັນ (ການຊັບຊ້ອນບຸກຄະລາກອນ, ການຈັດສັນງົບປະມານ...) \n- ມີມະຕິຕົກລົງ/ບົດບັນທຶກກອງປະຊຸມຂອງຄະນະຜູ້ບໍລິຫານ \n- ພະນັກງານ ແລະ ຄູສອນມີຄວາມເພິ່ງພໍໃຈກ່ຽວກັບການເຄື່ອນໄຫວວຽກງານຂອງຄະນະຜູ້ບໍລິຫານ'),
(15, 7, '- ມີແຜນງົບປະມານປະຈໍາປີ\n- ມີບົດສະຫຼຸບລາຍຮັບປະຈໍາປີ\n- ມີບົດສະຫຼຸບລາຍຈ່າຍປະຈໍາປີ\n- ຈັດສັນສັດສ່ວນການນໍາໃຊ້ງົບປະມານເຂົ້າໃນວຽກວິຊາການ ຫຼາຍກວ່າ ວຽກບໍລິຫານ\n'),
(18, 9, ' - ມີຂໍ້ກໍານົດການຈໍລະຈອນ ຂອງເອກະສານຂາອອກ-ຂາເຂົ້າ \n - ມີການນໍາໃຊ້ໄອຊີທີ ຫຼື ລະບົບຊອບແວຄຸ້ມຄອງເອກະສານ \n - ຜູ້ບໍລິຫານ, ພະນັກງານ, ຄູສອນ ແລະ ຜູ້ຮຽນ ມີຄວາມເພິ່ງພໍໃຈຕໍ່ການບໍລິຫານເອກະສານ'),
(19, 10, '- ມີເອກະສານທີ່ລະບຸເຖິງຂັ້ນຕອນຂອງການສື່ສານ ແລະ ປະສານງານພົວພັນວຽກງານພາຍໃນ ແລະ ພາຍນອກ ສະຖານການສຶກສາ\n- ນໍາໃຊ້ເຄື່ອງມືທັນສະໄໝທີ່ໃຊ້ໃນການປະສານງານພາຍໃນ (ກຸ່ມວອດແອັບ, ອີເມວ, ຊອບແວບໍລິຫານຫ້ອງການ ແລະ ອື່ນໆ)\n- ຄະນະນໍາ, ພະນັກງານ, ຄູສອນ ແລະ ຜູ້ຮຽນມີຄວາມເພິ່ງພໍໃຈຕໍ່ກັບການສື່ສານ ແລະ ປະສານງານພາຍໃນ'),
(23, 14, '-	ມີລາຍວິຊາ ຫຼື ສະມັດຖະພາບ, ໜ່ວຍກິດ ຫຼື ໂມດູນ, ສ່ວນຮ້ອຍຂອງທິດສະດີ, ປະຕິບັດ (ມີຢູ່ຕົວຊີ້ວັດທີ 13) (ຂອງພາກ)'),
(25, 15, '-	ມີແຜນສຳຫຼວດຄວາມຕ້ອງການຂອງສັງຄົມ ( ວຕວ )'),
(26, 16, '- ມີແຜນການທົບທວນໂຄງຫຼັກສູດ (ວຕວ)'),
(63, 3, '- ພາກສ່ວນກ່ຽວຂ້ອງ ມີຄວາມເຂົ້າໃຈ ຕໍ່ກັບການເຜີຍແຜ່ '),
(107, 8, ' - ມີການສັງລວມຂໍ້ຄົງຄ້າງຕາມມາດຕະຖານ \n - ມີການທົບທວນ ແລະ ຕິດຕາມວຽກງານການປະກັນຄຸນນະພາບພາຍໃນຂອງສະຖານການສຶກສາ \n - ນໍາເອົາຂໍ້ຄົງຄ້າງຕາມມາດຕະຖານ ເຂົ້າເປັນກິດຈະກໍາຂອງແຜນຕ່າງໆ ເພື່ອແກ້ໄຂ '),
(270, 4, '- ມີການທົບທວນຢ່າງໜ້ອຍ 3 ປີຕໍ່ຄັ້ງ \n- ພາກສ່ວນພາຍໃນ ແລະ ພາຍນອກສະຖານການສຶກສາ ມີສ່ວນຮ່ວມໃນການທົບທວນ \n- ສັງລວມບົດຮຽນທີ່ຖອດຖອນໄດ້ຈາກການທົບທວນ '),
(271, 11, '- ບຸກຄະລາກອນພຽງພໍກັບຕໍາແໜ່ງງານ\n- ມີການທົບທວນ ແລະ ປັບປຸງ ໜ້າທີ່ຮັບຜິດຊອບຂອງແຕ່ລະຕຳແໜ່ງງານ\n- ໜ້າທີ່ຂອງຕໍາແໜ່ງງານສອດຄ່ອງກັບ ພາລະກິດ/ໜ້າທີ່ ແລະ ແຜນຍຸດທະສາດຂອງສະຖານການສຶກສາ\n'),
(272, 12, '- ຈໍານວນຄູສອນ ທີ່ສອນໃນແຕ່ລະຫຼັກສູດ ສອດຄ່ອງຕາມວິຊາສະເພາະ ຫຼາຍກວ່າ 80%\n- ຈໍານວນຄູສອນ ທີ່ສອນໃນແຕ່ລະຫຼັກສູດ ສອດຄ່ອງຕາມປະສົບການຫຼາຍກວ່າ\n'),
(274, 17, '- ຄູສອນໄດ້ຮັບການສົ່ງເສີມໃນວຽກງານຕົວຈິງຈາກສະຖານການສຶກສາ ແລະ ສະຖານປະກອບການເກີນ 50%'),
(275, 18, '- ບຸກຄະລາກອນມີທັກສະການສື່ສານ ແລະ ນຳໃຊ້ພາສາຕ່າງປະເທດໃດໜຶ່ງ\n- ບຸກຄະລາກອນມີທັກສະການນໍາໃຊ້ໄອທີຂັ້ນພື້ນຖານ ເກີນ 50%\n'),
(276, 19, '- ມີການປະເມີນຢ່າງໜ້ອຍປີລະຄັ້ງ\n- ເຄື່ອງມືປະເມີນມີຕົວຊີ້ວັດທີ່ເປັນຮູບປະທຳ\n- ມີການນໍາໃຊ້ຜົນການປະເມີນ\n'),
(277, 20, '- ຜູ້ນໍາໃຊ້ມີຄວາມເພິ່ງໃຈໃນການນໍາໃຊ້'),
(278, 21, '- ຫ້ອງຮຽນ, ຫ້ອງທົດລອງ, ຫ້ອງຝຶກປະຕິບັດ, ຫ້ອງປະຊຸມ, ຫ້ອງສົນທະນາກຸ່ມ, ຫ້ອງສະໝຸດ ພຽງພໍ ກັບຈຳນວນນັກສຶກສາ ແລະ ເໝາະສົມກັບຫຼັກສູດ ທີ່ກຳນົດໄວ້ໃນລະບຽບການ\n- ຜູ້ຮຽນ ມີຄວາມເພິ່ງພໍໃຈໃນການນໍາໃຊ້\n'),
(279, 22, '- ເຄື່ອງມື, ເຄື່ອງຈັກ, ອຸປະກອນ ແລະ ສື່ຕ່າງໆ ພຽງພໍ ກັບຈຳນວນຜູ້ຮຽນ ແລະ ເໝາະສົມກັບຫຼັກສູດ\n- ຜູ້ຮຽນ ມີຄວາມເພິ່ງພໍໃຈ ໃນການນໍາໃຊ້ ສິ່ງອຳນວຍຄວາມສະດວກໃນການຝຶກປະຕິບັດ\n'),
(280, 23, '- ການແບ່ງປັນ ພຽງພໍ ແລະ ເໝາະສົມ ກັບຫຼັກສູດ/ສາຂາ\n- ຜູ້ຮຽນ ມີຄວາມເພິ່ງພໍໃຈໃນການນໍາໃຊ້ວັດຖຸດິບ ຫຼື ວັດສະດຸ\n'),
(281, 24, '- ມີເດີ່ນກິລາ ແລະ ສະໂມສອນ (ຖ້າບໍ່ມີເປັນຂອງຕົນເອງຕ້ອງມີສັນຍາເຊົ່າ) ພຽງພໍ ແລະ ເໝາະສົມ\n- ມີສະຖານທີ່ປະຕິບັດກິດຈະກຳ ແລະ ຄົ້ນຄວ້ານອກຫ້ອງຮຽນ ພຽງພໍ ແລະ ຄວາມເໝາະສົມ\n'),
(282, 25, '- ຜູ້ຮຽນສາມາດເຂົ້າເຖິງໄດ້ຫຼາຍຊ່ອງທາງ ເຊັ້ນ ຜ່ານທາງເວັບໄຊ້, ຖານຂໍ້ມູນ ແລະ ອື່ນໆ\n- ມີຄວາມພຽງພໍ ແລະ ຄວາມເໝາະສົມ\n- ຜູ້ຮຽນມີຄວາມເພິ່ງພໍໃຈໃນການນໍາໃຊ້\n'),
(283, 26, '- ມີຄວາມພຽງພໍ ແລະ ຄວາມເໝາະສົມ\n- ຜູ້ຮຽນມີຄວາມເພິ່ງພໍໃຈໃນການນໍາໃຊ້\n'),
(284, 27, '- ຄວາມແຮງຂອງສັນຍານອິນເຕີເນັດຕອບສະໜອງໄດ້ຂັ້ນພື້ນຖານ\n- ຄວາມໄວຂອງອິນເຕີເນັດຕອບສະໜອງໄດ້ຂັ້ນພື້ນຖານ\n- ຄູສອນ ແລະ ຜູ້ຮຽນສາມາດນໍາໃຊ້ໄດ້\n- ຄູອາຈານ ແລະ ຜູ້ຮຽນທີ່ໄດ້ນໍາໃຊ້ມີຄວາມເພິ່ງພໍໃຈ'),
(285, 28, '- ຄູສອນທຸກຄົນມີຊຸດການສອນຄົບຖ້ວນ\n- ມີກົນໄກການກວດບົດສອນໃນແຕ່ລະປີຂອງຄູສອນ\n- ບົດສອນມີເນື້ອໃນທັນກັບສະພາບການປ່ຽນແປງ\n'),
(286, 29, '- ມີການຕິດຕາມການນໍາໃຊ້ສື່ ຫຼື ສື່ທັນສະ ໄໝ\n- ຄູສອນ ຫຼາຍກວ່າ 80% ໄດ້ນໍາໃຊ້ ສື່ທັນສະໄໝ ເຊັ່ນ ເຄື່ອງສາຍ, ວີດີໂອ, ຮູບພາບ, ແບບຈຳລອງ ແລະ ເຄື່ອງປະຈັກຕາອື່ນໆ\n'),
(287, 30, '- ມີການປະເມີນທັກສະ ແລະ ຄວາມຊຳນານການນຳໃຊ້\n- ຄູສອນ ມີທັກສະ ແລະ ຄວາມຊໍານານ ໃນການນຳໃຊ້ ຫຼາຍກວ່າ 80%\n'),
(288, 31, '- ມີການໃຫ້ວຽກມອບໝາຍບຸກຄົນ, ກິດຈະກຳກຸ່ມ, ນຳສະເໜີ ແລະ ອື່ນໆ\n- ມີການຕິດຕາມ ແລະ ກວດກາ ວຽກມອບໝາຍ ແລະ ກິດຈະກຳທີ່ມອບໝາຍ\n- ມີການໃຫ້ຄໍາແນະນໍາເພື່ອປັບປຸງການຮຽນ\n'),
(289, 32, '- ຄູສອນ ໄດ້ນໍາໃຊ້ເຄື່ອງມືການປະເມີນທີ່ມີຕົວຊີ້ວັດ/ຣູບິກ ເພື່ອປະເມີນຄວາມສາມາດຂອງຜູ້ຮຽນຕາມຜົນການຮຽນຂອງໂມດູນ\n- ຄູສອນ ມີວິທີການປະເມີນສອດຄ່ອງກັບຈຸດປະສົງຂອງໂມດູນ\n'),
(290, 33, '- ມີການຕິດຕາມການສອນຢ່າງປົກກະຕິ\n- ຄູຂຶ້ນຫ້ອງສອນເປົນປົກກະຕິເກີນ 90%\n- ຊຸກຍູ້ຊ່ວຍເຫຼືອ\n'),
(291, 34, '- ມີເອກະສານແນະນໍາ ຜູ້ຮຽນ ໃນການເຂົ້າເຖິງ\n- ມີພາກສ່ວນ/ຜູ້ ຮັບຜິດຊອບ\n- ຜູ້ຮຽນມີຄວາມເພິ່ງພໍໃຈໃນການໃຫ້ຄໍາປຶກສາ\n'),
(292, 35, '- ມີກິດຈະກໍາເພື່ອສົ່ງເສີມ\n- ຜູ້ຮຽນຫຼາຍກວ່າ 50% ມີທັກສະເປັນຜູ້ປະກອບການ ຫຼື ການປະກອບອາຊີບ\n'),
(293, 36, '- ມີກິດຈະກໍາເພື່ອສົ່ງເສີມ\n- ຜູ້ຮຽນຫຼາຍກວ່າ 50% ມີທັກສະການສື່ສານ, ການປະສານງານ ແລະ ການເຮັດວຽກເປັນທີມ\n'),
(294, 37, '- ມີກົນໄກການແນະນໍາ\n- ຜູ້ຮຽນໄດ້ຮັບການແນະນໍາດ້ານ ດ້ານສຸຂະອານາໄມ ແລະ ຄວາມປອດໄພ'),
(295, 38, '- ຜູ້ຮຽນໄດ້ເຂົ້າຮ່ວມກິດຈະກໍາຫຼາຍກວ່າ 60%\n- ມີຂໍ້ມູນດ້ານຈໍານວນ ແລະ ຕໍາແໜ່ງງານທີ່ຕ້ອງການ ໃນສະຖານປະກອບການ\n- ສະຖານປະກອບການ ໄດ້ຮັບຜູ້ຮຽນຈົບເຂົ້າເຮັດວຽກ\n'),
(296, 39, '- ຜູ້ຮຽນໄດ້ຝຶກປະຕິງານ ຫຼື ເຂົ້າຮ່ວມການຮຽນການສອນແບບຄວບຄູ່ ຢູ່ສະຖານປະກອບການຫຼາຍກວ່າ 20%'),
(297, 40, '- ຈໍານວນຫຼັກສູດໄດ້ຮ່ວມມືກັບສະຖານປະກອບການໃນການທົບທວນ ຫຼາຍກວ່າ 50%'),
(298, 41, '- ມີການທັດສະນະສຶກສາ ແລກປ່ຽນບົດຮຽນດ້ານວິຊາການ\n- ມີການເຂົ້າຮ່ວມການແຂ່ງຂັນທັກສະວິຊາຊີບ-ມີການເຂົ້າຮ່ວມການປະເມີນພາຍໃນ ຂອງເຄືອຂ່າຍ ແຕ່ລະພາກ\n- ມີການການເຂົ້າຮ່ວມກອງປະຊຸມເຄືອຂ່າຍ\n- ອະທິບາຍຜົນໄດ້ຮັບຈາກການເຂົ້າຮ່ວມເປັນສະມາຊິກເຄືອຂ່າຍ\n'),
(299, 42, '- ມີແຜນ ແລະ ອະທິບາຍວິທີການເກັບກໍາ\n- ສັງລວມຜົນໄດ້ຮັບຈາກການເກັບກໍາແລະ ວິເຄາະທ່າອ່ຽງ\n- ນໍາໃຊ້ຜົນການເກັບກໍາເພື່ອວາງແນວທາງ ປັບປຸງແກ້ໄຂ ຫຼື ຊຸກຍູ້ສົ່ງເສີມ\n'),
(300, 48, '- ມີແຜນ ແລະ ອະທິບາຍວິທີການເກັບກຳ\n- ວິເຄາະຄວາມສອດຄ່ອງລະຫວ່າງວິຊາສະເພາະຮຽນຈົບ ແລະ ອາຊີບ, ຕໍາແໜ່ງ ແລະ ບ່ອນເຮັດວຽກ\n- ນໍາໃຊ້ຜົນການວິເຄາະ ເພື່ອແນວທາງການປັບປຸງແກ້ໄຂ ຫຼື ຊຸກຍູ້ສົ່ງເສີມ\n'),
(301, 49, '- ມີແຜນ ແລະ ອະທິບາຍວິທີການສົ່ງເສີມ\n- ສັງລວມຜົນໄດ້ຮັບຈາກການສົ່ງເສີມ ຫົວຄິດປະດິດສ້າງ ແລະ ການສ້າງຜະລິດຕະພັນ\n- ນໍາໃຊ້ຜົນເພື່ອວາງແນວທາງການປັບປຸງແກ້ໄຂ ຫຼື ຊຸກຍູ້ສົ່ງເສີມ\n'),
(302, 50, '- ຢ່າງໜ້ອຍ 1/3 ຂອງຈໍານວນສາຂາອາຊີບມີການສ້າງງານຮັບວິຊາການ\n- ມີແຜນ ແລະ ອະທິບາຍວິທີການສ້າງລາຍຮັບວິຊາການ\n- ກໍານົດກິດຈະກໍາ ແລະ ວິຊາສະເພາະ ທີ່ໃຊ້ສ້າງລາຍຮັບ\n- ສັງລວມຜົນໄດ້ຮັບຈາກການບໍລິການ (ງົບປະມານ ແລະ ຄວາມຮູ້ດ້ານວິຊາການ)\n- ນໍາໃຊ້ຜົນເພື່ອວາງແນວທາງການປັບປຸງແກ້ໄຂ ຫຼື ຊຸກຍູ້ສົ່ງເສີມ\n'),
(303, 51, '- ມີແຜນການເກັບກໍາຄວາມເພິ່ງພໍໃຈ\n- ມີເຄື່ອງມືການເກັບກໍາ\n- ອະທິບາຍວິທີການເກັບກໍາ\n- ສັງລວມຜົນການເກັບກໍາ ແລະ ນໍາໃຊ້ຜົນຂອງການເກັບກຳເພື່ອປັບປຸງແກ້ໄຂ\n'),
(304, 52, '- ແຜນການຕິດຕາມ\n- ມີເຄື່ອງມືການຕິດຕາມທີ່ສອດຄ່ອງຜົນການຮຽນຂອງຫຼັກສູດ\n- ອະທິບາຍວິທີການຕິດຕາມ\n- ສັງລວມຜົນການຕິດຕາມ ແລະ ນໍາໃຊ້ຜົນເພື່ອປັບປຸງແກ້ໄຂ\n'),
(305, 53, '- ມີໜ່ວຍງານ/ຜູ້ຮັບຜິດຊອບ\n- ມີແຜນ (ແຜນງົບປະມານ-ແຜນກິດຈະກຳ)\n- ມີເຄື່ອງມື ແລະ ອະທິບາຍວິທີການ\n- ສັງລວມຜົນໄດ້ຮັບ (ຈໍານວນຕົວເລກນັກສຶກສາເຂົ້າຮຽນ, ຈຳນວນເຄືອຂ່າຍສະຖານປະກອບການ, ງົບປະມານທີ່ໄດ້ຮັບ ແລະ ອື່ນໆ)\n- ນໍາໃຊ້ຜົນເພື່ອປັບປຸງແກ້ໄຂ\n\n'),
(306, 54, '- ມີໜ່ວຍງານ/ຜູ້ຮັບຜິດຊອບ\n- ສັງລວມປະເດັນ ຫຼື ຂໍ້ມູນທີ່ສໍາຄັນ ຢູ່ໃນບົດສັງລວມຫຍໍ້ປະຈຳປີ\n- ອະທິບາຍການນໍາໃຊ້ ແລະ ຊ່ອງທາງການເຂົ້າເຖິງ\n- ສັງລວມຜົນໄດ້ຮັບຈາກການນໍາໃຊ້ (ຈໍານວນຕົວເລກນັກສຶກສາເຂົ້າຮຽນ, ຈຳນວນເຄືອຂ່າຍສະຖານປະກອບການ, ງົບປະມານທີ່ໄດ້ຮັບ ແລະ ອື່ນໆ)\n- ນໍາໃຊ້ຜົນການສັງລວມເພື່ອປັບປຸງແກ້ໄຂ\n');

-- --------------------------------------------------------

--
-- Table structure for table `tb_department`
--

CREATE TABLE IF NOT EXISTS `tb_department` (
`departmentID` int(11) NOT NULL,
  `departmentName` varchar(255) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `tb_department`
--

INSERT INTO `tb_department` (`departmentID`, `departmentName`) VALUES
(1, 'ພະແນກບໍລິຫານ ແລະ ຈັດຕັ້ງພະນັກງານ'),
(2, 'ພະແນກວິຊາການ'),
(3, 'ພະແນກກິດຈະການນັກສຶກສາ'),
(4, 'ພາກວິຊາບໍລິຫານ-ທຸລະກິດ'),
(5, 'ພາກວິຊາເຕັກໂນໂລຊີໄຟຟ້າ'),
(6, 'ພາກວິຊາອຸດສາຫະກໍາ'),
(7, 'ພາກວິຊາບໍລິຫານໂຮງແຮມ ແລະ ການທ່ອງທ່ຽວ'),
(8, 'ພາກວິຊາກໍ່ສ້າງເຄຫາສະຖານ'),
(9, 'ສຸນຝຶກອົບຮົມການບໍລິການໂຮງແຮມ ແລະ ການທອງທຽວ');

-- --------------------------------------------------------

--
-- Table structure for table `tb_document`
--

CREATE TABLE IF NOT EXISTS `tb_document` (
`documentID` int(11) NOT NULL,
  `userID` int(11) NOT NULL,
  `basisMainID` int(11) NOT NULL,
  `yearID` int(11) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=150 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `tb_document`
--

INSERT INTO `tb_document` (`documentID`, `userID`, `basisMainID`, `yearID`) VALUES
(1, 5, 285, 1),
(2, 5, 286, 1),
(3, 5, 287, 1),
(4, 5, 288, 1),
(5, 5, 289, 1),
(6, 5, 290, 1),
(7, 10, 1, 1),
(8, 10, 285, 1),
(10, 10, 286, 1),
(11, 10, 289, 1),
(12, 10, 290, 1),
(13, 10, 287, 1),
(14, 10, 288, 1),
(15, 10, 297, 1),
(16, 10, 296, 1),
(17, 10, 295, 1),
(18, 10, 294, 1),
(19, 10, 282, 1),
(20, 10, 278, 1),
(21, 10, 279, 1),
(22, 10, 280, 1),
(23, 10, 281, 1),
(24, 10, 277, 1),
(25, 5, 282, 1),
(26, 5, 283, 1),
(27, 10, 3, 1),
(28, 10, 291, 1),
(29, 10, 293, 1),
(30, 10, 292, 1),
(31, 5, 284, 1),
(32, 10, 283, 1),
(33, 10, 284, 1),
(34, 10, 11, 1),
(35, 10, 13, 1),
(36, 10, 15, 1),
(37, 10, 18, 1),
(38, 10, 107, 1),
(39, 10, 19, 1),
(40, 10, 274, 1),
(41, 10, 275, 1),
(42, 10, 272, 1),
(43, 10, 276, 1),
(44, 10, 298, 1),
(45, 10, 303, 1),
(46, 10, 304, 1),
(47, 10, 305, 1),
(48, 10, 306, 1),
(49, 10, 301, 1),
(50, 10, 302, 1),
(51, 10, 299, 1),
(52, 10, 300, 1),
(53, 10, 271, 1),
(55, 12, 281, 1),
(56, 12, 278, 1),
(57, 9, 1, 1),
(58, 9, 290, 1),
(59, 9, 270, 1),
(60, 9, 285, 1),
(61, 9, 286, 1),
(62, 9, 287, 1),
(63, 9, 288, 1),
(64, 9, 289, 1),
(65, 9, 291, 1),
(66, 9, 296, 1),
(67, 9, 297, 1),
(68, 9, 11, 1),
(69, 9, 19, 1),
(70, 9, 271, 1),
(71, 9, 276, 1),
(72, 9, 278, 1),
(73, 9, 281, 1),
(74, 9, 298, 1),
(76, 9, 295, 1),
(77, 9, 300, 1),
(78, 9, 299, 1),
(79, 9, 294, 1),
(80, 9, 302, 1),
(81, 9, 301, 1),
(82, 9, 292, 1),
(83, 9, 293, 1),
(84, 9, 303, 1),
(85, 7, 291, 1),
(86, 9, 304, 1),
(87, 9, 306, 1),
(88, 9, 305, 1),
(89, 12, 3, 1),
(90, 12, 107, 1),
(91, 12, 271, 1),
(92, 12, 272, 1),
(93, 12, 276, 1),
(94, 7, 293, 1),
(95, 12, 277, 1),
(96, 12, 274, 1),
(97, 12, 15, 1),
(98, 12, 302, 1),
(99, 12, 305, 1),
(100, 9, 277, 1),
(101, 9, 15, 1),
(102, 9, 18, 1),
(103, 9, 13, 1),
(104, 7, 292, 1),
(105, 12, 270, 1),
(106, 12, 18, 1),
(107, 12, 19, 1),
(108, 12, 275, 1),
(109, 12, 63, 1),
(110, 11, 303, 1),
(111, 11, 304, 1),
(112, 11, 306, 1),
(113, 11, 305, 1),
(114, 11, 15, 1),
(115, 11, 11, 1),
(116, 11, 13, 1),
(118, 11, 299, 1),
(119, 11, 19, 1),
(120, 11, 302, 1),
(121, 11, 300, 1),
(122, 11, 277, 1),
(123, 11, 18, 1),
(124, 11, 291, 1),
(125, 11, 107, 1),
(126, 11, 301, 1),
(127, 11, 281, 1),
(128, 11, 280, 1),
(129, 7, 294, 1),
(130, 11, 295, 1),
(131, 11, 296, 1),
(132, 11, 297, 1),
(133, 11, 298, 1),
(134, 11, 282, 1),
(135, 11, 283, 1),
(136, 11, 284, 1),
(137, 12, 304, 1),
(138, 7, 305, 1),
(139, 7, 304, 1),
(140, 7, 303, 1),
(141, 12, 295, 1),
(142, 12, 296, 1),
(143, 12, 297, 1),
(144, 12, 282, 1),
(145, 7, 306, 1),
(146, 7, 300, 1),
(147, 7, 299, 1),
(148, 7, 301, 1),
(149, 7, 302, 1);

-- --------------------------------------------------------

--
-- Table structure for table `tb_file`
--

CREATE TABLE IF NOT EXISTS `tb_file` (
`fileID` int(11) NOT NULL,
  `documentID` int(11) NOT NULL,
  `fileNo` varchar(100) COLLATE utf8_unicode_ci NOT NULL,
  `fileName` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `fileSize` int(11) NOT NULL,
  `fileType` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `fileLocation` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `fileDate` date NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=355 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `tb_file`
--

INSERT INTO `tb_file` (`fileID`, `documentID`, `fileNo`, `fileName`, `fileSize`, `fileType`, `fileLocation`, `fileDate`) VALUES
(1, 1, '45/ວຕວ-ຫຼບ, ວັນທີ 12 ມິຖຸນາ 2023', 'ຊຸດການສອນວິຊາຕິດຕັ້ງແລະ ສ້ອມແປງແອ2024.pdf', 6379126, 'application/pdf', '2023-2024/1_ຊຸດການສອນວິຊາຕິດຕັ້ງແລະ ສ້ອມແປງແອ2024.pdf', '2025-03-04'),
(2, 1, '0196/ວຕວ-ຫຼບ, ວັນທີ 11 / 01 / 2024', 'ຊຸດການສອນວິຊາ ການບໍລິຫານບຸກຄະລາກອນ  (ພາກທິດສະດີ).pdf', 1466043, 'application/pdf', '2023-2024/1_ຊຸດການສອນວິຊາ ການບໍລິຫານບຸກຄະລາກອນ  (ພາກທິດສະດີ).pdf', '2025-03-04'),
(3, 1, '020/ວຕວ-ຫຼບ, ວັນທີ 09 / 09 / 2024', 'ຊຸດການສອນພາກທິດສະດີ ວິຊາໄຟຟ້າພະລັງງານແສງຕາວັນ.pdf', 5283426, 'application/pdf', '2023-2024/1_ຊຸດການສອນພາກທິດສະດີ ວິຊາໄຟຟ້າພະລັງງານແສງຕາວັນ.pdf', '2025-03-04'),
(4, 1, '020/ວຕວ-ຫຼບ, ວັນທີ 09 / 09 / 2024', 'ຊຸດການສອນພາກປະຕິບັດ ວິຊາການຕິດຕັ້ງໄຟຟ້າແສງຕາເວັນ.pdf', 3990209, 'application/pdf', '2023-2024/1_ຊຸດການສອນພາກປະຕິບັດ ວິຊາການຕິດຕັ້ງໄຟຟ້າແສງຕາເວັນ.pdf', '2025-03-04'),
(5, 1, '024/ວຕວ-ຫຼບ, ວັນທີ 05 / 09 /2023', 'ຊຸຸດການສອນທິດສະດີ ແລະ ພາກປະຕິບັດ ວິຊາ ການນໍາໃຊ້ເຄື່ອງມື ແລະ ຂະບາວນການຕ່າງໆທາງທຸລະກິດ.pdf', 5521795, 'application/pdf', '2023-2024/1_ຊຸຸດການສອນທິດສະດີ ແລະ ພາກປະຕິບັດ ວິຊາ ການນໍາໃຊ້ເຄື່ອງມື ແລະ ຂະບາວນການຕ່າງໆທາງທຸລະກິດ.pdf', '2025-03-04'),
(6, 1, '0193/ວຕວ-ຫຼບ, ວັນທີ 11 / 01 / 2024', 'ຊຸດການສອນພາກທິດສະດີ ວິຊາພາສາອັງກິດທົ່ວໄປ (Plan of teaching (2023-2024).pdf', 3088898, 'application/pdf', '2023-2024/1_ຊຸດການສອນພາກທິດສະດີ ວິຊາພາສາອັງກິດທົ່ວໄປ (Plan of teaching (2023-2024).pdf', '2025-03-04'),
(7, 1, 'ເລກທີ 013/ວຕວ-ຫຼບ, ວັນທີ 05 / 09 / 2023', 'ຊຸດການສອນW&P2.pdf', 4647040, 'application/pdf', '2023-2024/1_ຊຸດການສອນW&P2.pdf', '2025-03-04'),
(8, 1, 'ເລກທີ 029/ວຕວ-ຫຼບ, ວັນທີ 09 / 01 / 2024', 'ຊຸດການສອນ ວິຊາການບໍລິການໄຟສະຕາດ (ທິດສະດີ).pdf', 2666328, 'application/pdf', '2023-2024/1_ຊຸດການສອນ ວິຊາການບໍລິການໄຟສະຕາດ (ທິດສະດີ).pdf', '2025-03-04'),
(9, 2, 'ຮູບພາບ', '1. ຮູບເຄື່ອງທົດລອງ ການບໍລິການໄຟສະຕາດ.jpg', 207290, 'image/jpeg', '2023-2024/2_1. ຮູບເຄື່ອງທົດລອງ ການບໍລິການໄຟສະຕາດ.jpg', '2025-03-04'),
(10, 2, 'ຮູບພາບ', '1. ຮູບເຄື່ອງທົດລອງ ໄຟຟ້າພະລັງງານແສງຕາວັນ.jpg', 154519, 'image/jpeg', '2023-2024/2_1. ຮູບເຄື່ອງທົດລອງ ໄຟຟ້າພະລັງງານແສງຕາວັນ.jpg', '2025-03-04'),
(11, 2, 'ຮູບພາບ', '2. ຮູບເຄື່ອງທົດລອງ ການບໍລິການໄຟສະຕາດ.jpg', 223707, 'image/jpeg', '2023-2024/2_2. ຮູບເຄື່ອງທົດລອງ ການບໍລິການໄຟສະຕາດ.jpg', '2025-03-04'),
(12, 2, 'ຮູບພາບ', '2. ຮູບເຄື່ອງທົດລອງ ໄຟຟ້າພະລັງງານແສງຕາວັນ.jpg', 117541, 'image/jpeg', '2023-2024/2_2. ຮູບເຄື່ອງທົດລອງ ໄຟຟ້າພະລັງງານແສງຕາວັນ.jpg', '2025-03-04'),
(13, 2, 'ຮູບພາບ', '3. ຮູບເຄື່ອງທົດລອງ ໄຟຟ້າພະລັງງານແສງຕາວັນ.jpg', 68112, 'image/jpeg', '2023-2024/2_3. ຮູບເຄື່ອງທົດລອງ ໄຟຟ້າພະລັງງານແສງຕາວັນ.jpg', '2025-03-04'),
(14, 2, 'ຮູບພາບ', '4. ຮູບເຄື່ອງທົດລອງ ໄຟຟ້າພະລັງງານແສງຕາວັນ.jpg', 82779, 'image/jpeg', '2023-2024/2_4. ຮູບເຄື່ອງທົດລອງ ໄຟຟ້າພະລັງງານແສງຕາວັນ.jpg', '2025-03-04'),
(15, 2, 'ຮູບພາບ', '5. ຮູບເຄື່ອງທົດລອງ ໄຟຟ້າພະລັງງານແສງຕາວັນ.jpg', 147741, 'image/jpeg', '2023-2024/2_5. ຮູບເຄື່ອງທົດລອງ ໄຟຟ້າພະລັງງານແສງຕາວັນ.jpg', '2025-03-04'),
(16, 2, 'ຮູບພາບ', '6. ຮູບເຄື່ອງທົດລອງ ໄຟຟ້າພະລັງງານແສງຕາວັນ.jpg', 21572, 'image/jpeg', '2023-2024/2_6. ຮູບເຄື່ອງທົດລອງ ໄຟຟ້າພະລັງງານແສງຕາວັນ.jpg', '2025-03-04'),
(17, 3, 'ບໍ່ມີເລກທີ', 'ລິ້ງປະເມີນຄູ.pdf', 79429, 'application/pdf', '2023-2024/3_ລິ້ງປະເມີນຄູ.pdf', '2025-03-04'),
(18, 4, 'ບໍ່ມີເລກທີ', 'ໃບມອບວຽກ ຄັ້ງທີ 1, ໃບດຳເນີນງານ, ໃບລາຍການອຸປະກອນ ແລະ ໃບການໃຫ້ຄະແນນ.pdf', 239008, 'application/pdf', '2023-2024/4_ໃບມອບວຽກ ຄັ້ງທີ 1, ໃບດຳເນີນງານ, ໃບລາຍການອຸປະກອນ ແລະ ໃບການໃຫ້ຄະແນນ.pdf', '2025-03-04'),
(19, 5, 'ບໍ່ມີເລກທີ', 'ຜົນການຮຽນໄດ້ຖືກປະເມີນ.pdf', 125724, 'application/pdf', '2023-2024/5_ຜົນການຮຽນໄດ້ຖືກປະເມີນ.pdf', '2025-03-04'),
(20, 5, 'ບໍ່ມີເລກທີ', 'ໃບຢັ້ງຢືນຜົນການຮຽນຂອງນັກຮຽນ.pdf', 784449, 'application/pdf', '2023-2024/5_ໃບຢັ້ງຢືນຜົນການຮຽນຂອງນັກຮຽນ.pdf', '2025-03-04'),
(21, 6, 'ບໍ່ມີເລກທີ', 'ການບັນທຶກການຂຶ້ນຫ້ອງຂອງຄູ ແລະ ນັກສຶກສາ.pdf', 90547, 'application/pdf', '2023-2024/6_ການບັນທຶກການຂຶ້ນຫ້ອງຂອງຄູ ແລະ ນັກສຶກສາ.pdf', '2025-03-04'),
(22, 6, 'ບໍ່ມີເລກທີ', 'ເຄື່ອງມືການຮ່ວມໂມງສອນ.pdf', 1862422, 'application/pdf', '2023-2024/6_ເຄື່ອງມືການຮ່ວມໂມງສອນ.pdf', '2025-03-04'),
(23, 6, 'ບໍ່ມີເລກທີ', 'ໃບ​ຕິດ​ຕາມ​ຂື້ນ​ຫ້ອງ2023-2024.pdf', 91688, 'application/pdf', '2023-2024/6_ໃບ​ຕິດ​ຕາມ​ຂື້ນ​ຫ້ອງ2023-2024.pdf', '2025-03-04'),
(25, 8, 'ບໍ່ມີເລກທີ', '_________ _____________________ (_______).pdf', 2666328, 'application/pdf', '2023-2024/8__________ _____________________ (_______).pdf', '2025-05-07'),
(26, 9, 'ບໍ່ມີເລກທີ', 'ຕິດຕາມຂຶ້ນຫ້ອງພາກວິຊາ ອຸດສາຫະກໍາ2023-2024 - ລົດຍົນ1(9+3)DCT.pdf', 96486, 'application/pdf', '2023-2024/9_ຕິດຕາມຂຶ້ນຫ້ອງພາກວິຊາ ອຸດສາຫະກໍາ2023-2024 - ລົດຍົນ1(9+3)DCT.pdf', '2025-05-07'),
(27, 10, 'ບໍ່ມີເລກທີ', '1. _______________ _________________.jpg', 207290, 'image/jpeg', '2023-2024/10_1. _______________ _________________.jpg', '2025-05-08'),
(31, 13, 'ຮູບພາບ', '2. _______________ _________________.jpg', 223707, 'image/jpeg', '2023-2024/13_2. _______________ _________________.jpg', '2025-05-16'),
(32, 14, 'ບໍ່ມີເລກທີ', 'TVET QA Guideline 20250224 Final (1).pdf', 1984163, 'application/pdf', '2023-2024/14_TVET QA Guideline 20250224 Final (1).pdf', '2025-05-16'),
(34, 12, 'ບໍ່ມີເລກທີ', '____________________2023-2024.pdf', 91688, 'application/pdf', '2023-2024/12_____________________2023-2024.pdf', '2025-05-19'),
(35, 14, 'ບໍ່ມີເລກທີ', '________ ______ 1, ___________, _______________ ___ _____________.pdf', 239008, 'application/pdf', '2023-2024/14_________ ______ 1, ___________, _______________ ___ _____________.pdf', '2025-05-19'),
(36, 13, 'ບໍ່ມີເລກທີ', '________ ______ 1, ___________, _______________ ___ _____________.pdf', 239008, 'application/pdf', '2023-2024/13_________ ______ 1, ___________, _______________ ___ _____________.pdf', '2025-05-19'),
(40, 16, 'ບໍ່ມີເລກທີ', 'MOU.pdf', 3750270, 'application/pdf', '2023-2024/16_MOU.pdf', '2025-05-22'),
(42, 17, 'ຮູບພາບ', 'fcc8e2f1-b984-4560-975f-670d5d1168cf.jpg', 200433, 'image/jpeg', '2023-2024/17_fcc8e2f1-b984-4560-975f-670d5d1168cf.jpg', '2025-05-22'),
(43, 17, 'ບໍ່ມີເລກທີ', 'ບົດບັນທຶກ.pdf', 5658802, 'application/pdf', '2023-2024/17_ບົດບັນທຶກ.pdf', '2025-05-22'),
(44, 17, 'ບໍ່ມີເລກທີ', 'MOU.pdf', 3750270, 'application/pdf', '2023-2024/17_MOU.pdf', '2025-05-22'),
(45, 17, 'ຮູບພາບ', 'f6efb063-5fe2-40c4-935f-5521a20a0a48.jpg', 346994, 'image/jpeg', '2023-2024/17_f6efb063-5fe2-40c4-935f-5521a20a0a48.jpg', '2025-05-22'),
(46, 18, 'ຮູບພາບ', '7dd8495e-3c7b-468d-86f8-e90709e86512.jpg', 78308, 'image/jpeg', '2023-2024/18_7dd8495e-3c7b-468d-86f8-e90709e86512.jpg', '2025-05-22'),
(47, 18, 'ຮູບພາບ', '10b4d2be-2183-4c32-9cad-711d51c5564d.jpg', 170304, 'image/jpeg', '2023-2024/18_10b4d2be-2183-4c32-9cad-711d51c5564d.jpg', '2025-05-22'),
(48, 18, 'ຮູບພາບ', '83cc78ca-62e7-4c78-8e44-d7fba1defa92.jpg', 265690, 'image/jpeg', '2023-2024/18_83cc78ca-62e7-4c78-8e44-d7fba1defa92.jpg', '2025-05-22'),
(49, 18, 'ຮູບພາບ', 'baa8bdd7-8f70-4775-b173-b0dd2f26626e.jpg', 73334, 'image/jpeg', '2023-2024/18_baa8bdd7-8f70-4775-b173-b0dd2f26626e.jpg', '2025-05-22'),
(50, 18, 'ຮູບພາບ', '10b4d2be-2183-4c32-9cad-711d51c5564d.jpg', 170304, 'image/jpeg', '2023-2024/18_10b4d2be-2183-4c32-9cad-711d51c5564d.jpg', '2025-05-22'),
(51, 16, 'ຮູບພາບ', '6dd9034e-9042-4838-849e-b810e05993e6.jpg', 150771, 'image/jpeg', '2023-2024/16_6dd9034e-9042-4838-849e-b810e05993e6.jpg', '2025-05-22'),
(52, 16, 'ຮູບພາບ', 'e3b8172c-63cf-49e0-8a16-383d986896e7.jpg', 306945, 'image/jpeg', '2023-2024/16_e3b8172c-63cf-49e0-8a16-383d986896e7.jpg', '2025-05-22'),
(53, 16, 'ຮູບພາບ', 'bc3b223d-d922-414c-bd57-3a8908cdb250.jpg', 151127, 'image/jpeg', '2023-2024/16_bc3b223d-d922-414c-bd57-3a8908cdb250.jpg', '2025-05-22'),
(55, 16, 'ຮູບພາບ', 'c46655b8-ca47-4458-8963-7bc3a3624d0b.jpg', 175582, 'image/jpeg', '2023-2024/16_c46655b8-ca47-4458-8963-7bc3a3624d0b.jpg', '2025-05-22'),
(58, 21, 'ຮູບພາບ', '5, ມີເຄື່ອງມື, ເຄື່ອງຈັກ, ອຸປະກອນແລະສື່ຕ່າງໆ.pdf', 809758, 'application/pdf', '2023-2024/21_5, ມີເຄື່ອງມື, ເຄື່ອງຈັກ, ອຸປະກອນແລະສື່ຕ່າງໆ.pdf', '2025-05-28'),
(59, 22, 'ຮູບພາບ', '7. ຜູ້ຮຽນຮັບຮູ້ ແລະການໃຊ້ມາດຖານຄວາມປອດໄພ - Copy.pdf', 568225, 'application/pdf', '2023-2024/22_7. ຜູ້ຮຽນຮັບຮູ້ ແລະການໃຊ້ມາດຖານຄວາມປອດໄພ - Copy.pdf', '2025-05-28'),
(60, 23, 'ຮູບພາບ', '8, ມີເດີ່ນກິລາ ແລະ ສະໂມສອນ.pdf', 1080995, 'application/pdf', '2023-2024/23_8, ມີເດີ່ນກິລາ ແລະ ສະໂມສອນ.pdf', '2025-05-28'),
(61, 22, 'ຮູບພາບ', '6, ແຜນຄວາມຕ້ອງການ, ບໍາລຸງຮັກສາຢ່າງເຫມາະສົມ - Copy.pdf', 519538, 'application/pdf', '2023-2024/22_6, ແຜນຄວາມຕ້ອງການ, ບໍາລຸງຮັກສາຢ່າງເຫມາະສົມ - Copy.pdf', '2025-05-28'),
(62, 20, 'ຮູບພາບ', '3,ມີປ້າຍສັນຍາລັກເຂົ້າອາຄານສະຖານທີ່ຕ່າງໆ.pdf', 1069112, 'application/pdf', '2023-2024/20_3,ມີປ້າຍສັນຍາລັກເຂົ້າອາຄານສະຖານທີ່ຕ່າງໆ.pdf', '2025-05-28'),
(63, 24, 'ຮູບພາບ', '1.ມີຫ້ອງນໍ້າໃຊ້ໄດ້.pdf', 994525, 'application/pdf', '2023-2024/24_1.ມີຫ້ອງນໍ້າໃຊ້ໄດ້.pdf', '2025-05-28'),
(64, 24, 'ຮູບພາບ', '2.ມີລະບົບໄຟ້າໃຊ້ໄດ້.pdf', 742169, 'application/pdf', '2023-2024/24_2.ມີລະບົບໄຟ້າໃຊ້ໄດ້.pdf', '2025-05-28'),
(65, 20, 'ຮູບພາບ', '4, ຫ້ອງຮຽນ ຫ້ອງທົດລອງ ຫ້ອງປະຊູມ.pdf', 990727, 'application/pdf', '2023-2024/20_4, ຫ້ອງຮຽນ ຫ້ອງທົດລອງ ຫ້ອງປະຊູມ.pdf', '2025-05-28'),
(67, 26, 'ຮູບພາບ', 'ເຄື່ອງປະຈັກຕາ. ລະບົບແອ.pdf', 1052273, 'application/pdf', '2023-2024/26_ເຄື່ອງປະຈັກຕາ. ລະບົບແອ.pdf', '2025-05-28'),
(68, 26, '0276 ວຕວ-ຫຼບ', 'ແຜນຄວາມຕ້ອງການ ແລະ ບໍລຸງຮັກສາ.pdf', 1026966, 'application/pdf', '2023-2024/26_ແຜນຄວາມຕ້ອງການ ແລະ ບໍລຸງຮັກສາ.pdf', '2025-05-28'),
(70, 27, '2113 ວັນທີ 17 AUG 2020', 'ແຜນຍຸດທະສາດ 21-25.pdf', 317343, 'application/pdf', '2023-2024/27_ແຜນຍຸດທະສາດ 21-25.pdf', '2025-05-28'),
(72, 29, 'ຮູບພາບ', 'ຕົວຊີ້ວັດທີ 36.pdf', 714417, 'application/pdf', '2023-2024/29_ຕົວຊີ້ວັດທີ 36.pdf', '2025-05-28'),
(75, 15, 'ບໍ່ມີເລກທີ', 'ລົດຍົນ ປີ 1(12+2) DCT (1).pdf', 88082, 'application/pdf', '2023-2024/15_ລົດຍົນ ປີ 1(12+2) DCT (1).pdf', '2025-05-28'),
(76, 15, 'ບໍ່ມີເລກທີ', 'ຫຼັກສູດຊ່າງສ້ອມແປງເຄື່ອງຈັກລົດຍົນ22,9,2022 (1).pdf', 2234657, 'application/pdf', '2023-2024/15_ຫຼັກສູດຊ່າງສ້ອມແປງເຄື່ອງຈັກລົດຍົນ22,9,2022 (1).pdf', '2025-05-28'),
(77, 15, 'ບໍ່ມີເລກທີ', 'ຫຼັກສູດຊ່າງສ້ອມແປງໄຟຟ້າລົດຍົນ22,9,2022 (1).pdf', 2069936, 'application/pdf', '2023-2024/15_ຫຼັກສູດຊ່າງສ້ອມແປງໄຟຟ້າລົດຍົນ22,9,2022 (1).pdf', '2025-05-28'),
(78, 25, 'ຮູບພາບ', 'ເວັບໄຊວິທະຍາໄລ ແລະ facebook ວິທະຍາໄລ.pdf', 1929105, 'application/pdf', '2023-2024/25_ເວັບໄຊວິທະຍາໄລ ແລະ facebook ວິທະຍາໄລ.pdf', '2025-05-28'),
(79, 31, '3090/ວຕວ-ຫຼບ, ລົງວັນທີ10/10/2023', 'ໜັງສືສະເໜີການຊົມໃຊ້ລະບົບ ອິນເຕີເນັດຂອງ ຕວຕ 04-30-2024 10.54.pdf', 1213160, 'application/pdf', '2023-2024/31_ໜັງສືສະເໜີການຊົມໃຊ້ລະບົບ ອິນເຕີເນັດຂອງ ຕວຕ 04-30-2024 10.54.pdf', '2025-05-28'),
(80, 32, 'ຮູບພາບ', 'ບັນຊີສາງ.pdf', 64078, 'application/pdf', '2023-2024/32_ບັນຊີສາງ.pdf', '2025-05-28'),
(81, 33, 'ບໍ່ມີເລກທີ', 'ໜັງສືສະເໜີຂໍນໍາໃຊ້ອິນເຕີເນັດ.pdf', 64079, 'application/pdf', '2023-2024/33_ໜັງສືສະເໜີຂໍນໍາໃຊ້ອິນເຕີເນັດ.pdf', '2025-05-28'),
(83, 19, 'ບໍ່ມີເລກທີ', 'ເວັບໄຊ ແລະ ຂໍ້ມູນຕ່າງ.pdf', 41867, 'application/pdf', '2023-2024/19_ເວັບໄຊ ແລະ ຂໍ້ມູນຕ່າງ.pdf', '2025-05-28'),
(84, 31, '3056/ວຕວ-ຫຼບ, ລົງວັນທີ 05/9/2024', 'ງົບປະມານຊື້ແພັກເກັດ ອິນເຕີເນັດພາຍໃນວິທະຍາໄລ ສໍາລັບຫ້ອງການ.pdf', 1253754, 'application/pdf', '2023-2024/31_ງົບປະມານຊື້ແພັກເກັດ ອິນເຕີເນັດພາຍໃນວິທະຍາໄລ ສໍາລັບຫ້ອງການ.pdf', '2025-05-28'),
(85, 31, '472/ວຕວ-ຫຼບ, ລົງວັນທີ 06/2/2025', 'ງົບປະມານຊື້ອິນເຕີເນັດ ຫ້ອງຄອມພີວເຕີ.pdf', 1056142, 'application/pdf', '2023-2024/31_ງົບປະມານຊື້ອິນເຕີເນັດ ຫ້ອງຄອມພີວເຕີ.pdf', '2025-05-28'),
(87, 27, '180 ລົງວັນທີ 17/2/2024', 'ແຜນສ້ອມແປງ ແລະ ຕໍ່ເຕີມອາຄານ.pdf', 429434, 'application/pdf', '2023-2024/27_ແຜນສ້ອມແປງ ແລະ ຕໍ່ເຕີມອາຄານ.pdf', '2025-05-28'),
(88, 29, '1796/ວຕວ-ຫຼບ,ວັນທີ 28 ພຶດສະພາ 2024', 'ຂໍ້ຕົກລົງບໍລິການສັງຄົມ.pdf_6-13-2024-_10-09-16_AM.pdf', 1354182, 'application/pdf', '2023-2024/29_ຂໍ້ຕົກລົງບໍລິການສັງຄົມ.pdf_6-13-2024-_10-09-16_AM.pdf', '2025-05-28'),
(89, 24, 'ບໍ່ມີເລກທີ', 'ແບບຟອມປະເມີນ.pdf', 362421, 'application/pdf', '2023-2024/24_ແບບຟອມປະເມີນ.pdf', '2025-05-28'),
(90, 34, ' 258ວັນທີ 24ພະຈິກ2023', 'ມາດຖານ2(ຕົວຊີ້ວັດ1).pdf', 1753409, 'application/pdf', '2023-2024/34_ມາດຖານ2(ຕົວຊີ້ວັດ1).pdf', '2025-05-28'),
(100, 37, 'ຮູບພາບ', 'ມາດຖານ2(ຕົວຊີ້ວັດ5).pdf', 1088898, 'application/pdf', '2023-2024/37_ມາດຖານ2(ຕົວຊີ້ວັດ5).pdf', '2025-05-28'),
(101, 39, 'ຮູບພາບ', 'ມາດຖານ2(ຕົວຊີ້ວັດທີ6).pdf', 372925, 'application/pdf', '2023-2024/39_ມາດຖານ2(ຕົວຊີ້ວັດທີ6).pdf', '2025-05-28'),
(106, 43, 'ບໍ່ມີເລກທີ', 'ປະເມີນແຕ່ລະພະແນກພາກວິຊາ - Copy.pdf', 44450, 'application/pdf', '2023-2024/43_ປະເມີນແຕ່ລະພະແນກພາກວິຊາ - Copy.pdf', '2025-05-29'),
(107, 44, '205 ວຕວ-ຫຼບ.ອກ', 'ສັງລວມຜົນໄດ້ຮັບປະກັນຄຸນນະພາບ.pdf', 232733, 'application/pdf', '2023-2024/44_ສັງລວມຜົນໄດ້ຮັບປະກັນຄຸນນະພາບ.pdf', '2025-05-29'),
(108, 16, '048', 'ສະຖານທີ່ຝຶກງານຮ່ວມກັບການຮຽນການສອນແບບຄວບຄູ່.pdf', 360999, 'application/pdf', '2023-2024/16_ສະຖານທີ່ຝຶກງານຮ່ວມກັບການຮຽນການສອນແບບຄວບຄູ່.pdf', '2025-05-29'),
(109, 12, 'ບໍ່ມີເລກທີ', 'CamScanner 29-05-2025 10.37.pdf', 609351, 'application/pdf', '2023-2024/12_CamScanner 29-05-2025 10.37.pdf', '2025-05-29'),
(111, 13, 'ບໍ່ມີເລກທີ', 'ltvcQA_5-29-2025-_10-57-18_AM.pdf', 362421, 'application/pdf', '2023-2024/13_ltvcQA_5-29-2025-_10-57-18_AM.pdf', '2025-05-29'),
(112, 11, 'ບໍ່ມີເລກທີ', 'ltvcQA_5-29-2025-_10-57-18_AM.pdf', 362421, 'application/pdf', '2023-2024/11_ltvcQA_5-29-2025-_10-57-18_AM.pdf', '2025-05-29'),
(113, 11, 'ບໍ່ມີເລກທີ', 'CamScanner 29-05-2025 10.39.pdf', 474989, 'application/pdf', '2023-2024/11_CamScanner 29-05-2025 10.39.pdf', '2025-05-29'),
(114, 28, '0622/ວຕວ-ຫຼບ ວັນທີ 12 ກຸມພາ 2024', 'ຂໍ້ຕົກລົງຕິດນັກສຶກກກອນຮຽນຈົບ ແລະ ຄວາມເພິ່ງພໍໃຈ.pdf', 31326, 'application/pdf', '2023-2024/28_ຂໍ້ຕົກລົງຕິດນັກສຶກກກອນຮຽນຈົບ ແລະ ຄວາມເພິ່ງພໍໃຈ.pdf', '2025-05-29'),
(115, 44, 'ບໍ່ມີເລກທີ', 'ໂຄງການທັດສະນະສຶກສາ 2023.pdf', 180316, 'application/pdf', '2023-2024/44_ໂຄງການທັດສະນະສຶກສາ 2023.pdf', '2025-05-29'),
(116, 44, 'ບໍ່ມີເລກທີ', 'ໜັງສືສະເໜີຂໍຂໍ້ຕົກລົງ_ໄປ_ທັດ_ສ_ະນະນໍ້າປະປາເມືອງງອຍ 23-23.pdf', 162911, 'application/pdf', '2023-2024/44_ໜັງສືສະເໜີຂໍຂໍ້ຕົກລົງ_ໄປ_ທັດ_ສ_ະນະນໍ້າປະປາເມືອງງອຍ 23-23.pdf', '2025-05-29'),
(118, 33, 'ຮູບພາບ', 'ເວັບໄຊ້.pdf', 41867, 'application/pdf', '2023-2024/33_ເວັບໄຊ້.pdf', '2025-05-29'),
(119, 19, '49/ອກ/23/5/2024', 'ບັນຊີສາງ.pdf', 64078, 'application/pdf', '2023-2024/19_ບັນຊີສາງ.pdf', '2025-05-29'),
(120, 33, 'ຮູບພາບ', 'ຄວາມແຮງຂອງສັນຍານອິນເຕີເນັດຕອບສະໜອງໄດ້ຂັ້ນພື້ນຖານ.pdf', 51816, 'application/pdf', '2023-2024/33_ຄວາມແຮງຂອງສັນຍານອິນເຕີເນັດຕອບສະໜອງໄດ້ຂັ້ນພື້ນຖານ.pdf', '2025-05-29'),
(121, 30, '263/ວຕວ-ຫຼບ.ອກ ວັນທີ 11 /12/2023', 'ຕົວຊີ້ວັດ ທີ່ 35 ແຂ່ງຂັນສີມື ອຸດສາຫະກຳ.pdf', 378137, 'application/pdf', '2023-2024/30_ຕົວຊີ້ວັດ ທີ່ 35 ແຂ່ງຂັນສີມື ອຸດສາຫະກຳ.pdf', '2025-05-29'),
(122, 27, '0995 ວັນທີ 19 ມິນາ 2024', 'ແຜນບຳລຸງຮັກສາ.pdf', 158880, 'application/pdf', '2023-2024/27_ແຜນບຳລຸງຮັກສາ.pdf', '2025-05-29'),
(123, 7, 'ຮູບພາບ', 'WhatsApp Image 2025-05-29 at 14.44.52_5fb2d1b8.jpg', 228585, 'image/jpeg', '2023-2024/7_WhatsApp Image 2025-05-29 at 14.44.52_5fb2d1b8.jpg', '2025-05-29'),
(124, 19, 'ຮູບພາບ', 'ປື້ມຕໍາລາ ວາລະສານ.pdf', 159440, 'application/pdf', '2023-2024/19_ປື້ມຕໍາລາ ວາລະສານ.pdf', '2025-05-29'),
(125, 32, 'ຮູບພາບ', 'ສອນພາກປະຕິບັດຕົວຈີງ.pdf', 124212, 'application/pdf', '2023-2024/32_ສອນພາກປະຕິບັດຕົວຈີງ.pdf', '2025-05-29'),
(126, 32, 'ຮູບພາບ', 'ມີເຄື່ອງປະຈັກຕາ.pdf', 107566, 'application/pdf', '2023-2024/32_ມີເຄື່ອງປະຈັກຕາ.pdf', '2025-05-29'),
(127, 45, '185/ວຕວ-ຫຼບ.ອກ ລົງວັນມີ 7/6/2024', 'ແຜນການເກັບກຳ ມາດຖານ 10 ຕົວຊີ້ວັດ 1 .1..pdf', 75931, 'application/pdf', '2023-2024/45_ແຜນການເກັບກຳ ມາດຖານ 10 ຕົວຊີ້ວັດ 1 .1..pdf', '2025-05-29'),
(128, 45, 'ຮູບພາບ', 'ແຜນການເກັບກຳ ມາດຖານ 10 ຕົວຊີ້ວັດ 1 .2..pdf', 1140093, 'application/pdf', '2023-2024/45_ແຜນການເກັບກຳ ມາດຖານ 10 ຕົວຊີ້ວັດ 1 .2..pdf', '2025-05-29'),
(129, 45, '31/ວຕວ-ຫຼບ.ອກ 25/4/2024', 'ແຜນການເກັບກຳ ມາດຖານ 10 ຕົວຊີ້ວັດ 1 .3..pdf', 720979, 'application/pdf', '2023-2024/45_ແຜນການເກັບກຳ ມາດຖານ 10 ຕົວຊີ້ວັດ 1 .3..pdf', '2025-05-29'),
(130, 41, 'ບໍ່ມີເລກທີ', 'Coursera B3REYBMG28GU.pdf', 66195, 'application/pdf', '2023-2024/41_Coursera B3REYBMG28GU.pdf', '2025-05-29'),
(131, 46, '0927/ວຕວ-ຫຼບ ວັນທີ 15 ມີນາ 2024. 1822/ວຕວ-ຫຼບ ວັນທີ ໂຢ ເມສາ 2024. 121/ວຕວ-ຫຼບ.ກກ ວັນທີ 15/3/2024', 'ແຜນການຕິດຕາມມາດຖານ 10 ຕົວຊີ້ວັດ 2 .1..pdf', 5251551, 'application/pdf', '2023-2024/46_ແຜນການຕິດຕາມມາດຖານ 10 ຕົວຊີ້ວັດ 2 .1..pdf', '2025-05-29'),
(132, 46, 'ຮູບພາບ', 'ເຄື່ອງມືທີໃຊ້ຕິດຕາມ ມາດຖານ 10 ຕົວຊີ້ວັດ 2 .1..pdf', 1847670, 'application/pdf', '2023-2024/46_ເຄື່ອງມືທີໃຊ້ຕິດຕາມ ມາດຖານ 10 ຕົວຊີ້ວັດ 2 .1..pdf', '2025-05-29'),
(133, 46, 'ຮູບພາບ', 'ການນໍາເອົາຜົນການປະເມີນ ແຜນການເກັບກຳ ມາດຖານ 10 ຕົວຊີ້ວັດ 2 .3..pdf', 5808988, 'application/pdf', '2023-2024/46_ການນໍາເອົາຜົນການປະເມີນ ແຜນການເກັບກຳ ມາດຖານ 10 ຕົວຊີ້ວັດ 2 .3..pdf', '2025-05-29'),
(134, 47, '0885/ວຕວ-ຫຼບ ວັນທີ 13ມີນາ 2024. 1693/ວຕວ-ຫຼບ ວັນທີ 02 ມີຖຸນາ 2023', 'ແຕ່ງຕັ້ງຄະນະຮັບຜິດຊອບມາດຖານ 10 ຕົວຊີ້ວັດ 3 .1..pdf', 2334089, 'application/pdf', '2023-2024/47_ແຕ່ງຕັ້ງຄະນະຮັບຜິດຊອບມາດຖານ 10 ຕົວຊີ້ວັດ 3 .1..pdf', '2025-05-29'),
(135, 47, 'ຮູບພາບ', 'ການໂຄສະນາ ມາດຖານ 10 ຕົວຊີ້ວັດ 3  .3..pdf', 130657, 'application/pdf', '2023-2024/47_ການໂຄສະນາ ມາດຖານ 10 ຕົວຊີ້ວັດ 3  .3..pdf', '2025-05-29'),
(136, 48, '283/ວຕວ-ຫຼບ.ກກ ວັນທີ 12/9/2024', 'ບົດລາຍງານມາດຖານ 10 ຕົວຊີ້ວັດ 4.pdf', 1392398, 'application/pdf', '2023-2024/48_ບົດລາຍງານມາດຖານ 10 ຕົວຊີ້ວັດ 4.pdf', '2025-05-29'),
(137, 29, '4185/ວຕວ-ຫຼບ ວັນທີ 14 ທັນວາ 2023', 'CamScanner 14-12-2023 17.03.pdf', 1077906, 'application/pdf', '2023-2024/29_CamScanner 14-12-2023 17.03.pdf', '2025-05-29'),
(138, 49, '3879/ວຕວຫ-ຫຼບ 29/11/2023', 'ນາມມະຍົດ.pdf', 616685, 'application/pdf', '2023-2024/49_ນາມມະຍົດ.pdf', '2025-05-29'),
(139, 20, 'ບໍ່ມີເລກທີ', 'ຜັງຈັດວາງເຄື່ອງ.pdf', 56684, 'application/pdf', '2023-2024/20_ຜັງຈັດວາງເຄື່ອງ.pdf', '2025-05-29'),
(140, 32, '50/ວຕວ 7/2/2024', 'ແຜນສອ້ມແປງ.pdf', 50519, 'application/pdf', '2023-2024/32_ແຜນສອ້ມແປງ.pdf', '2025-05-29'),
(141, 41, '2391/ອສ ວັນທີ 18 ທັນວາ 2023', 'ແຈ້ງການເລື່ອງທຶນຝຶກອົບຮົມໄລຍະສັ່ນຜ່ານລະບົບອອນລາຍ ພາສາຈີນ ຂອງແ.pdf', 783601, 'application/pdf', '2023-2024/41_ແຈ້ງການເລື່ອງທຶນຝຶກອົບຮົມໄລຍະສັ່ນຜ່ານລະບົບອອນລາຍ ພາສາຈີນ ຂອງແ.pdf', '2025-05-29'),
(142, 50, 'ຮູບພາບ', 'ນະໂຍບາຍ ມາດຖານ 9 ຕົວຊີ້ວັດ 4.pdf', 166667, 'application/pdf', '2023-2024/50_ນະໂຍບາຍ ມາດຖານ 9 ຕົວຊີ້ວັດ 4.pdf', '2025-05-29'),
(143, 51, '39/ວຕວ-ຫຼບ.ອກ ວັນທີ 18/໌5/2024', 'ຂໍ້ມູນຜູ້ຮຽນຈົບ ແຜນການເກັບກຳ ມາດຖານ 9  ຕົວຊີ້ວັດ 1 .1..pdf', 2133649, 'application/pdf', '2023-2024/51_ຂໍ້ມູນຜູ້ຮຽນຈົບ ແຜນການເກັບກຳ ມາດຖານ 9  ຕົວຊີ້ວັດ 1 .1..pdf', '2025-05-29'),
(144, 29, 'ຮູບພາບ', 'ໜັງສືສະເໜີແລກປ່ຽນບົດຮຽນ.pdf', 289409, 'application/pdf', '2023-2024/29_ໜັງສືສະເໜີແລກປ່ຽນບົດຮຽນ.pdf', '2025-05-29'),
(145, 43, '4316 ວັນທີ 27 ທັນວາ 2023', 'ຂໍ້ຕົກລົງປະເມີນ3ຂໍ້ແຂ່ງຂັນ.pdf', 1410528, 'application/pdf', '2023-2024/43_ຂໍ້ຕົກລົງປະເມີນ3ຂໍ້ແຂ່ງຂັນ.pdf', '2025-05-29'),
(147, 41, 'ບໍ່ມີເລກທີ', 'ລາຍຊື່ຜູ້ເຂົ້າຮຽນcoursera ທີ່ໄດ້ໃບຢັ້ງຢືນ.pdf', 113216, 'application/pdf', '2023-2024/41_ລາຍຊື່ຜູ້ເຂົ້າຮຽນcoursera ທີ່ໄດ້ໃບຢັ້ງຢືນ.pdf', '2025-05-29'),
(148, 29, 'ບໍ່ມີເລກທີ', 'ຕາຕະລາງແຂ່ງຂັນກິລາບານສົ່ງນັກສຶກສາຊິງຂັນທ່ານຜູ້ອຳນວຍການ.pdf', 634536, 'application/pdf', '2023-2024/29_ຕາຕະລາງແຂ່ງຂັນກິລາບານສົ່ງນັກສຶກສາຊິງຂັນທ່ານຜູ້ອຳນວຍການ.pdf', '2025-05-29'),
(149, 52, '41/ວຕວ-ຫຼບ.ອກ', 'ມາດຖານ 9 ຕົວຊີ້ວັດ 2.pdf', 415446, 'application/pdf', '2023-2024/52_ມາດຖານ 9 ຕົວຊີ້ວັດ 2.pdf', '2025-05-29'),
(150, 53, '58/ວຕວ-ຫຼບ.ອກ ລົງວັນທີ 21/102024', 'ຂໍ້ຕົກລົງພາກ.pdf', 3287618, 'application/pdf', '2023-2024/53_ຂໍ້ຕົກລົງພາກ.pdf', '2025-06-02'),
(151, 53, '05/ວຕວ-ຫຼບ.ອກ ລົງວັນທີ 27 ມັງກອນ 2024', 'ສະຖິຕິຄູ-ອາຈານ.pdf', 1432145, 'application/pdf', '2023-2024/53_ສະຖິຕິຄູ-ອາຈານ.pdf', '2025-06-02'),
(152, 53, '07/ວຕວ-ຫຼບ.ອກ ລົງວັນທີ 14 ມັງກອນ 2024', 'ໃບລົງທະບຽນ.pdf', 813457, 'application/pdf', '2023-2024/53_ໃບລົງທະບຽນ.pdf', '2025-06-02'),
(153, 42, '05/ວຕວ-ຫຼບ.ອກ ລົງວັນທີ 27 ມັງກອນ 2024', 'ສະຖິຕິຄູ-ອາຈານ.pdf', 1432145, 'application/pdf', '2023-2024/42_ສະຖິຕິຄູ-ອາຈານ.pdf', '2025-06-02'),
(154, 42, 'ຮູບພາບ', 'ຕາຕະລາງສອນ.pdf', 609448, 'application/pdf', '2023-2024/42_ຕາຕະລາງສອນ.pdf', '2025-06-02'),
(155, 54, 'ບໍ່ມີເລກທີ', 'CamScanner 06-02-2025 10.55.pdf', 577809, 'application/pdf', '2023-2024/54_CamScanner 06-02-2025 10.55.pdf', '2025-06-02'),
(160, 58, 'ບໍ່ມີເລກທີ', 'CamScanner 06-02-2025 11.10.pdf', 615238, 'application/pdf', '2023-2024/58_CamScanner 06-02-2025 11.10.pdf', '2025-06-02'),
(162, 41, '23/ວຕວ-ຫຼບ.ອກ ວັນທີ 18 ມີນາ 2023', 'ltvcQA_6-2-2025-_11-16-37_AM.pdf', 417604, 'application/pdf', '2023-2024/41_ltvcQA_6-2-2025-_11-16-37_AM.pdf', '2025-06-02'),
(163, 60, '45', 'ຊຸດການສອນຄົບຖ້ວນ.pdf', 6379126, 'application/pdf', '2023-2024/60_ຊຸດການສອນຄົບຖ້ວນ.pdf', '2025-06-02'),
(164, 24, 'ຮູບພາບ', 'ltvcQA_6-2-2025-_11-22-36_AM.pdf', 1069112, 'application/pdf', '2023-2024/24_ltvcQA_6-2-2025-_11-22-36_AM.pdf', '2025-06-02'),
(165, 61, 'ຮູບພາບ', '1. _______________ _________________.jpg', 207290, 'image/jpeg', '2023-2024/61_1. _______________ _________________.jpg', '2025-06-02'),
(166, 62, 'ຮູບພາບ', '____________.pdf', 79429, 'application/pdf', '2023-2024/62_____________.pdf', '2025-06-02'),
(167, 63, 'ບໍ່ມີເລກທີ', 'ltvcQA_6-2-2025-_1-13-27_PM.pdf', 239008, 'application/pdf', '2023-2024/63_ltvcQA_6-2-2025-_1-13-27_PM.pdf', '2025-06-02'),
(168, 64, 'ບໍ່ມີເລກທີ', 'ltvcQA_6-2-2025-_1-15-45_PM.pdf', 125724, 'application/pdf', '2023-2024/64_ltvcQA_6-2-2025-_1-15-45_PM.pdf', '2025-06-02'),
(169, 65, 'ບໍ່ມີເລກທີ', 'ແບບສອບຖາມຄວາມຄິດເຫັນ ແລະ ຄວາມເພີ່ງພໍໃຈຂອງຜູ້ຮຽນ ພາກວິຊາເຕັກໂນໂລຊີໄຟຟ້າ ສົກຮຽນ 2023-2024 (ຕອບກັບ).xlsx', 16785, 'application/vnd.openxmlformats-officedocument.spreadsheetml.sheet', '2023-2024/65_ແບບສອບຖາມຄວາມຄິດເຫັນ ແລະ ຄວາມເພີ່ງພໍໃຈຂອງຜູ້ຮຽນ ພາກວິຊາເຕັກໂນໂລຊີໄຟຟ້າ ສົກຮຽນ 2023-2024 (ຕອບກັບ).xlsx', '2025-06-02'),
(170, 66, '4191', 'CamScanner 06-02-2025 13.41.pdf', 463144, 'application/pdf', '2023-2024/66_CamScanner 06-02-2025 13.41.pdf', '2025-06-02'),
(171, 67, 'ບໍ່ມີເລກທີ', 'ຈໍານວນຫຼັກສູດໄດ້ຮ່ວມມືກັບສະຖານປະກອບ.pdf', 105201, 'application/pdf', '2023-2024/67_ຈໍານວນຫຼັກສູດໄດ້ຮ່ວມມືກັບສະຖານປະກອບ.pdf', '2025-06-02'),
(174, 69, 'ບໍ່ມີເລກທີ', 'whatsapp ພາກວິຊາ.docx', 440001, 'application/vnd.openxmlformats-officedocument.wordprocessingml.document', '2023-2024/69_whatsapp ພາກວິຊາ.docx', '2025-06-02'),
(175, 70, 'ບໍ່ມີເລກທີ', 'ຂໍ້ຕົກລົງຄວາມຮັບຜິດຊອບ 2023-2024.xlsx', 16556, 'application/vnd.openxmlformats-officedocument.spreadsheetml.sheet', '2023-2024/70_ຂໍ້ຕົກລົງຄວາມຮັບຜິດຊອບ 2023-2024.xlsx', '2025-06-02'),
(176, 71, 'ບໍ່ມີເລກທີ', 'ຄູ່ມືແນະນຳການປະເມີນຜົນງານຄູ_ສອນ 2023-2024.docx', 34161, 'application/vnd.openxmlformats-officedocument.wordprocessingml.document', '2023-2024/71_ຄູ່ມືແນະນຳການປະເມີນຜົນງານຄູ_ສອນ 2023-2024.docx', '2025-06-02'),
(177, 72, 'ບໍ່ມີເລກທີ', 'ຫ້ອງຮຽນ.pdf', 1069112, 'application/pdf', '2023-2024/72_ຫ້ອງຮຽນ.pdf', '2025-06-02'),
(178, 73, 'ບໍ່ມີເລກທີ', 'ເດີນບານ.pdf', 1080995, 'application/pdf', '2023-2024/73_ເດີນບານ.pdf', '2025-06-02'),
(179, 74, '3307/ວຕວ.ຫຼບ', 'ຂໍ້ຕົກລົງ_ແຕ່ງຕັ້ງພະນັກງານຄູ_ແລະນັກສຶກສາ_ໄປ ທັດສະນະ_.pdf', 861904, 'application/pdf', '2023-2024/74_ຂໍ້ຕົກລົງ_ແຕ່ງຕັ້ງພະນັກງານຄູ_ແລະນັກສຶກສາ_ໄປ ທັດສະນະ_.pdf', '2025-06-02'),
(180, 75, 'ຮູບພາບ', 'CamScanner 03-06-2025 10.28.pdf', 399580, 'application/pdf', '2023-2024/75_CamScanner 03-06-2025 10.28.pdf', '2025-06-03'),
(181, 76, 'ບໍ່ມີເລກທີ', 'MOU.pdf', 3750270, 'application/pdf', '2023-2024/76_MOU.pdf', '2025-06-03'),
(182, 77, '35', 'CamScanner 06-03-2025 10.45.pdf', 333783, 'application/pdf', '2023-2024/77_CamScanner 06-03-2025 10.45.pdf', '2025-06-03'),
(184, 79, 'ຮູບພາບ', 'ຄວາມປອດໄພ.pdf', 399580, 'application/pdf', '2023-2024/79_ຄວາມປອດໄພ.pdf', '2025-06-03'),
(185, 80, 'ຮູບພາບ', 'WhatsApp Image 2025-06-03 at 11.05.22.jpeg', 268184, 'image/jpeg', '2023-2024/80_WhatsApp Image 2025-06-03 at 11.05.22.jpeg', '2025-06-03'),
(186, 80, 'ຮູບພາບ', 'WhatsApp Image 2025-06-03 at 11.05.20.jpeg', 223647, 'image/jpeg', '2023-2024/80_WhatsApp Image 2025-06-03 at 11.05.20.jpeg', '2025-06-03'),
(188, 82, 'ຮູບພາບ', '06bc211e-6023-49e2-bd91-7ce49d40dfc0.jpg', 286339, 'image/jpeg', '2023-2024/82_06bc211e-6023-49e2-bd91-7ce49d40dfc0.jpg', '2025-06-03'),
(189, 82, 'ຮູບພາບ', '6ff5a355-f681-423c-bfa3-1fb21eda7ab7.jpg', 54135, 'image/jpeg', '2023-2024/82_6ff5a355-f681-423c-bfa3-1fb21eda7ab7.jpg', '2025-06-03'),
(190, 82, 'ຮູບພາບ', '26a85e4b-c21d-46f5-abf5-288e7a6bea8a.jpg', 41597, 'image/jpeg', '2023-2024/82_26a85e4b-c21d-46f5-abf5-288e7a6bea8a.jpg', '2025-06-03'),
(191, 83, 'ຮູບພາບ', '4c4d08f3-a798-4150-ad37-579997a1d364.jpg', 186575, 'image/jpeg', '2023-2024/83_4c4d08f3-a798-4150-ad37-579997a1d364.jpg', '2025-06-03'),
(192, 83, 'ຮູບພາບ', '8f521aea-ebd2-4ba5-8249-fe4e26f8f1dd.jpg', 264996, 'image/jpeg', '2023-2024/83_8f521aea-ebd2-4ba5-8249-fe4e26f8f1dd.jpg', '2025-06-03'),
(193, 83, 'ຮູບພາບ', 'fb911ed4-15a3-420c-b400-35b9b6701907.jpg', 489806, 'image/jpeg', '2023-2024/83_fb911ed4-15a3-420c-b400-35b9b6701907.jpg', '2025-06-03'),
(194, 84, '78', 'ຄວາມພິ່ງພໍໄຈ2024-2025.pdf', 2220561, 'application/pdf', '2023-2024/84_ຄວາມພິ່ງພໍໄຈ2024-2025.pdf', '2025-06-03'),
(196, 86, 'ຮູບພາບ', 'QA ແຜນການຕິດຕາມ.jpg', 89647, 'image/jpeg', '2023-2024/86_QA ແຜນການຕິດຕາມ.jpg', '2025-06-03'),
(198, 88, '0885', 'ltvcQA_6-3-2025-_2-15-33_PM.pdf', 2334089, 'application/pdf', '2023-2024/88_ltvcQA_6-3-2025-_2-15-33_PM.pdf', '2025-06-03'),
(199, 87, '283', 'ltvcQA_6-3-2025-_2-25-13_PM.pdf', 1392398, 'application/pdf', '2023-2024/87_ltvcQA_6-3-2025-_2-25-13_PM.pdf', '2025-06-03'),
(200, 85, '4151 ວັນທີ 13 ທັນວາ 2023', 'ຂໍ້ຕົກລົງໃຫ້ຄຳປຶກສາ ແລະ ແນະແນວວິຊາຊີບ.pdf', 343240, 'application/pdf', '2023-2024/85_ຂໍ້ຕົກລົງໃຫ້ຄຳປຶກສາ ແລະ ແນະແນວວິຊາຊີບ.pdf', '2025-06-03'),
(201, 85, 'ຮູບພາບ', 'ເອກະສານແນະນຳ.pdf', 594206, 'application/pdf', '2023-2024/85_ເອກະສານແນະນຳ.pdf', '2025-06-03'),
(202, 89, 'ບໍ່ມີເລກທີ', '2.2 ມີແຜນງົບປະມານການກໍ່ສ້າງສ້ອມແປງໃຫຍ່ ແລະ ແຜນການກໍ່ສ້າງສ້ອມແປງນ້ອຍ ແລະ ໄດ້ມີການຈັດຕັ້ງປະຕິບັດຕາມແຜນທີ່ວາງໄວ້.pdf', 2953219, 'application/pdf', '2023-2024/89_2.2 ມີແຜນງົບປະມານການກໍ່ສ້າງສ້ອມແປງໃຫຍ່ ແລະ ແຜນການກໍ່ສ້າງສ້ອມແປງນ້ອຍ ແລະ ໄດ້ມີການຈັດຕັ້ງປະຕິບັດຕາມແຜນທີ່ວາງໄວ້.pdf', '2025-06-03'),
(203, 90, '69', '4.3 ໄດ້ນຳເອົາຂໍ້ຄົງຄ້າງມາປັບປຸງ ແລະ ແກ້ໄຂຕາມການແນະນຳ.pdf', 1141690, 'application/pdf', '2023-2024/90_4.3 ໄດ້ນຳເອົາຂໍ້ຄົງຄ້າງມາປັບປຸງ ແລະ ແກ້ໄຂຕາມການແນະນຳ.pdf', '2025-06-03'),
(204, 91, '13', '1.1 ມີສະຖິຕິ, ປະຫວັດຫຍໍ້, ປະສົບການ ການເຮັດວຽກ.pdf', 877341, 'application/pdf', '2023-2024/91_1.1 ມີສະຖິຕິ, ປະຫວັດຫຍໍ້, ປະສົບການ ການເຮັດວຽກ.pdf', '2025-06-03'),
(205, 91, '08', '1.2 ມີການແບ່ງໜ້າທີ່ຕາມພາລະບົດບາດໃນພະແນກ-ພາກວິຊາ.pdf', 2638516, 'application/pdf', '2023-2024/91_1.2 ມີການແບ່ງໜ້າທີ່ຕາມພາລະບົດບາດໃນພະແນກ-ພາກວິຊາ.pdf', '2025-06-03'),
(206, 92, '13', '2.1 ມີສະຖິຕິ, ວຸດທິ, ວິຊາສະເພາະ, ສາຂາ, ວິຊາສອນ.pdf', 877341, 'application/pdf', '2023-2024/92_2.1 ມີສະຖິຕິ, ວຸດທິ, ວິຊາສະເພາະ, ສາຂາ, ວິຊາສອນ.pdf', '2025-06-03'),
(207, 92, 'ບໍ່ມີເລກທີ', '2.2 ຕາຕາລາງຈັດແບ່ງຊົ່ວໂມງສອນຕາມວຸດທິ, ຕາມສາຂາວິຊາສະເພາະ.pdf', 479090, 'application/pdf', '2023-2024/92_2.2 ຕາຕາລາງຈັດແບ່ງຊົ່ວໂມງສອນຕາມວຸດທິ, ຕາມສາຂາວິຊາສະເພາະ.pdf', '2025-06-03'),
(208, 93, 'ບໍ່ມີເລກທີ', '5.1 ມິການປະເມີນ 3 ຂໍ້ແຂ່ງຂັນ.pdf', 396966, 'application/pdf', '2023-2024/93_5.1 ມິການປະເມີນ 3 ຂໍ້ແຂ່ງຂັນ.pdf', '2025-06-03'),
(209, 93, '1778', '5.2 ມີມາດຖານ ແລະ ຟອມໃຫ້ຄະແນນ.pdf', 23992886, 'application/pdf', '2023-2024/93_5.2 ມີມາດຖານ ແລະ ຟອມໃຫ້ຄະແນນ.pdf', '2025-06-03'),
(210, 93, '2971', '5.3 ບົດລາຍງານການຄົ້ນຄວ້າ.pdf', 747382, 'application/pdf', '2023-2024/93_5.3 ບົດລາຍງານການຄົ້ນຄວ້າ.pdf', '2025-06-03'),
(211, 93, '3323', '5.4 ມີຂໍ້ຕົກລົງຍ້ອງຍໍຂອງກະຊວງ ແລະ ຂໍ້ຕົກລົງຜູ້ອຳນວຍການວິທະຍາໄລ.pdf', 3450925, 'application/pdf', '2023-2024/93_5.4 ມີຂໍ້ຕົກລົງຍ້ອງຍໍຂອງກະຊວງ ແລະ ຂໍ້ຕົກລົງຜູ້ອຳນວຍການວິທະຍາໄລ.pdf', '2025-06-03'),
(212, 85, 'ບໍ່ມີເລກທີ', 'ຜົນ ແບບສຳຫຼວດ ການໃຊ້ເຄື່ອງມື OASA ແບບທົດສອບຄວາມຖະນັດດ້ານອາຊີບ (1).pdf', 311702, 'application/pdf', '2023-2024/85_ຜົນ ແບບສຳຫຼວດ ການໃຊ້ເຄື່ອງມື OASA ແບບທົດສອບຄວາມຖະນັດດ້ານອາຊີບ (1).pdf', '2025-06-03'),
(213, 78, '25', 'CamScanner 06-03-2025 15.18.pdf', 749711, 'application/pdf', '2023-2024/78_CamScanner 06-03-2025 15.18.pdf', '2025-06-03'),
(214, 55, 'ບໍ່ມີເລກທີ', '4.1 ມີບັນຊີ (ເດີ່ນກິລາ ແລະ ສະໂມສອນ, ໂຕະຫີນ ແລະ ຕູບນັ່ງຫຼິ້ນ) ປະຕິບັດກິດຈະກຳ ແລະ ຄົ້ນຄວ້ານອກຫ້ອງຮຽນ ພຽງພໍ ແລະ ຄວາມເໝາະສົມ (ຮູບພາບປະກອບ).pdf', 4569298, 'application/pdf', '2023-2024/55_4.1 ມີບັນຊີ (ເດີ່ນກິລາ ແລະ ສະໂມສອນ, ໂຕະຫີນ ແລະ ຕູບນັ່ງຫຼິ້ນ) ປະຕິບັດກິດຈະກຳ ແລະ ຄົ້ນຄວ້ານອກຫ້ອງຮຽນ ພຽງພໍ ແລະ ຄວາມເໝາະສົມ (ຮູບພາບປະກອບ).pdf', '2025-06-03'),
(215, 94, '4447 ວັນທີ່ 03 ທັນວາ 2024', 'ວຽກງານກິລາ.pdf', 3816747, 'application/pdf', '2023-2024/94_ວຽກງານກິລາ.pdf', '2025-06-03'),
(216, 94, '4706 ວັນທີ່ 13 ທັນວາ 2024', 'ວຽກງານສິລະປະວັນນະຄະດີ 2023-2024.pdf', 2689592, 'application/pdf', '2023-2024/94_ວຽກງານສິລະປະວັນນະຄະດີ 2023-2024.pdf', '2025-06-03'),
(217, 95, 'ຮູບພາບ', '1.1 ມີຫ້ອງນໍ້າໃຊ້ໄດ້ພຽງພໍກັບຄວາມຕ້ອງການ.pdf', 507120, 'application/pdf', '2023-2024/95_1.1 ມີຫ້ອງນໍ້າໃຊ້ໄດ້ພຽງພໍກັບຄວາມຕ້ອງການ.pdf', '2025-06-03'),
(218, 95, 'ຮູບພາບ', '1.3 ມີແຜນຜັງ ແລະ ສັນຍາລັກການເຂົ້າເຖິງອາຄານ ແລະ ສະຖານທີ່.pdf', 400066, 'application/pdf', '2023-2024/95_1.3 ມີແຜນຜັງ ແລະ ສັນຍາລັກການເຂົ້າເຖິງອາຄານ ແລະ ສະຖານທີ່.pdf', '2025-06-03'),
(220, 97, '0035', '3.1 ມີແຜນງບົປະມານປະຈໍາປີ.pdf', 2754930, 'application/pdf', '2023-2024/97_3.1 ມີແຜນງບົປະມານປະຈໍາປີ.pdf', '2025-06-04'),
(221, 97, '0044', '3.2 ມີແຜນງົບປະມານ 1, 2, 3, 4.pdf', 834723, 'application/pdf', '2023-2024/97_3.2 ມີແຜນງົບປະມານ 1, 2, 3, 4.pdf', '2025-06-04'),
(222, 97, '0043', '3.3 ມີບົດສະຫຼຸບກວດ 0 ໂມງ.pdf', 1211104, 'application/pdf', '2023-2024/97_3.3 ມີບົດສະຫຼຸບກວດ 0 ໂມງ.pdf', '2025-06-04'),
(223, 97, '0036', '3.4 ໄດ້ຈັດສັນງົບປະມານຕາມສັດສ່ວນໃນແຕ່ລະຮ່ວງຂອງກະຊວງສຶກສາອານຸມັດໃຫ້.pdf', 3220961, 'application/pdf', '2023-2024/97_3.4 ໄດ້ຈັດສັນງົບປະມານຕາມສັດສ່ວນໃນແຕ່ລະຮ່ວງຂອງກະຊວງສຶກສາອານຸມັດໃຫ້.pdf', '2025-06-04'),
(226, 99, '1818/ວຕວ-ຫຼບ30/5/2024', 'ງົບປະມານບໍລິການສັງຄົມ 2024.pdf', 386610, 'application/pdf', '2023-2024/99_ງົບປະມານບໍລິການສັງຄົມ 2024.pdf', '2025-06-04'),
(227, 100, 'ຮູບພາບ', '4,1,1 ຫ້ອງຫນໍ້າ.jpeg', 399014, 'image/jpeg', '2023-2024/100_4,1,1 ຫ້ອງຫນໍ້າ.jpeg', '2025-06-04'),
(228, 98, '1796/ວຕວ-ຫຼບ/28/5/2024', 'ຂໍ້ຕົກລົງບໍລິການສັງຄົມ.pdf', 1354182, 'application/pdf', '2023-2024/98_ຂໍ້ຕົກລົງບໍລິການສັງຄົມ.pdf', '2025-06-04'),
(229, 101, '0044', 'ງົບປະມານຕາມງວດ.pdf', 834723, 'application/pdf', '2023-2024/101_ງົບປະມານຕາມງວດ.pdf', '2025-06-04'),
(230, 101, '3035', '2.3.1ແຜນງບົປະມານປະຈໍາປີ.pdf', 2754930, 'application/pdf', '2023-2024/101_2.3.1ແຜນງບົປະມານປະຈໍາປີ.pdf', '2025-06-04'),
(231, 101, '0047', '2,3,2 ສະຫຼຸບສູນໂມງ.pdf', 1211104, 'application/pdf', '2023-2024/101_2,3,2 ສະຫຼຸບສູນໂມງ.pdf', '2025-06-04'),
(232, 101, '0036', '2,3,4 ຈັດສັນງົບປະມານຕາມສັດສ່ວນ.pdf', 3220961, 'application/pdf', '2023-2024/101_2,3,4 ຈັດສັນງົບປະມານຕາມສັດສ່ວນ.pdf', '2025-06-04'),
(233, 102, 'ຮູບພາບ', 'WhatsApp Image 2025-06-04 at 09.36.48.jpeg', 87243, 'image/jpeg', '2023-2024/102_WhatsApp Image 2025-06-04 at 09.36.48.jpeg', '2025-06-04'),
(234, 103, 'ຮູບພາບ', 'WhatsApp Image 2025-06-04 at 09.36.48.jpeg', 87243, 'image/jpeg', '2023-2024/103_WhatsApp Image 2025-06-04 at 09.36.48.jpeg', '2025-06-04'),
(235, 104, '2743 ວັນທີ 23 ກໍລະກົດ 2024', 'ຂໍ້ຕົກລົງແຂ່ງຂັນທັກສະສີມືພາກທ່ອງທ່ຽວ.pdf', 1139138, 'application/pdf', '2023-2024/104_ຂໍ້ຕົກລົງແຂ່ງຂັນທັກສະສີມືພາກທ່ອງທ່ຽວ.pdf', '2025-06-04'),
(236, 71, '2971', 'ບົດລາຍງານຍ້ອງບໍ.pdf', 747382, 'application/pdf', '2023-2024/71_ບົດລາຍງານຍ້ອງບໍ.pdf', '2025-06-04'),
(237, 71, '3323', 'ຂໍ້ຕົກລົງຍ້ອງ.pdf', 3450925, 'application/pdf', '2023-2024/71_ຂໍ້ຕົກລົງຍ້ອງ.pdf', '2025-06-04'),
(238, 71, 'ຮູບພາບ', 'ມາດຖານ 3 ຂໍ້ແຂ່ງຂັນ ປັບປຸງໃໜ່ (1).docx', 27275, 'application/vnd.openxmlformats-officedocument.wordprocessingml.document', '2023-2024/71_ມາດຖານ 3 ຂໍ້ແຂ່ງຂັນ ປັບປຸງໃໜ່ (1).docx', '2025-06-04'),
(239, 100, 'ຮູບພາບ', 'ltvcQA_6-4-2025-_9-50-33_AM.pdf', 1069112, 'application/pdf', '2023-2024/100_ltvcQA_6-4-2025-_9-50-33_AM.pdf', '2025-06-04'),
(240, 104, '0528 ວັນທີ່ 7 ກຸມພາ 2024', 'jop matching.pdf', 1179818, 'application/pdf', '2023-2024/104_jop matching.pdf', '2025-06-04'),
(241, 104, '5014 ວັນທີ່ 14 ກັນຍາ 2023', 'ຝຶກເຂັ້ມອຸດສາຫະກຳ.pdf', 633183, 'application/pdf', '2023-2024/104_ຝຶກເຂັ້ມອຸດສາຫະກຳ.pdf', '2025-06-04');
INSERT INTO `tb_file` (`fileID`, `documentID`, `fileNo`, `fileName`, `fileSize`, `fileType`, `fileLocation`, `fileDate`) VALUES
(242, 105, 'ບໍ່ມີເລກທີ', '4.1 ໄດ້ມີກອງປະຊຸມທົບທວນວິໄສທັດ.pdf', 632813, 'application/pdf', '2023-2024/105_4.1 ໄດ້ມີກອງປະຊຸມທົບທວນວິໄສທັດ.pdf', '2025-06-04'),
(243, 106, 'ຮູບພາບ', '5.1 ຂໍ້ກຳນົດຈໍລະຈອນ ຂອງເອກະສານຂາອອກ-ຂາເຂົ້າ.pdf', 199873, 'application/pdf', '2023-2024/106_5.1 ຂໍ້ກຳນົດຈໍລະຈອນ ຂອງເອກະສານຂາອອກ-ຂາເຂົ້າ.pdf', '2025-06-04'),
(244, 106, 'ຮູບພາບ', '5.2 ໄດ້ນຳໃຊ້ໄອຊີທີ ຫຼື ລະບົບຊອບແວຄຸ້ມຄອງເອກະສານ.pdf', 199873, 'application/pdf', '2023-2024/106_5.2 ໄດ້ນຳໃຊ້ໄອຊີທີ ຫຼື ລະບົບຊອບແວຄຸ້ມຄອງເອກະສານ.pdf', '2025-06-04'),
(245, 107, 'ຮູບພາບ', '6.2 ນຳໃຊ້ເຄື່ອງມືທັນສະໄໝທີ່ໃຊ້ໃນການປະສານງານພາຍໃນ (ກຸ່ມວ໋ອດແອັບ, ອີເມວ, ຊອບແວບໍລິຫານຫ້ອງການ ແລະ ອື່ນໆ).pdf', 199873, 'application/pdf', '2023-2024/107_6.2 ນຳໃຊ້ເຄື່ອງມືທັນສະໄໝທີ່ໃຊ້ໃນການປະສານງານພາຍໃນ (ກຸ່ມວ໋ອດແອັບ, ອີເມວ, ຊອບແວບໍລິຫານຫ້ອງການ ແລະ ອື່ນໆ).pdf', '2025-06-04'),
(246, 108, '4175', '4.2 ມີແຈ້ງການເຂົ້າຮຽນ, ການສົ່ງເສີມໃຫ້ພະນັກງານຮໍ່າຮຽນພາສາຕ່າງປະເທດ.pdf', 587337, 'application/pdf', '2023-2024/108_4.2 ມີແຈ້ງການເຂົ້າຮຽນ, ການສົ່ງເສີມໃຫ້ພະນັກງານຮໍ່າຮຽນພາສາຕ່າງປະເທດ.pdf', '2025-06-04'),
(247, 96, '2221', '3.5 ມີຂໍ້ຕົກລົງຂອງຜູ້ອຳນວຍການເຂົ້າຮ່ວມຝຶກອົບຮົມວິຊາສະເພາະແຕ່ລະສາຂາ.pdf', 1267407, 'application/pdf', '2023-2024/96_3.5 ມີຂໍ້ຕົກລົງຂອງຜູ້ອຳນວຍການເຂົ້າຮ່ວມຝຶກອົບຮົມວິຊາສະເພາະແຕ່ລະສາຂາ.pdf', '2025-06-04'),
(248, 109, 'ບໍ່ມີເລກທີ', '3.1 ໄດ້ມີການເຜີຍແຜ່ວິໄສທັດໃຫ້ຄູອາຈານ, ນັກສຶກສາ ແລະ ສັງຄົມພາຍນອກໄດ້ຮັບຮູ້.pdf', 433079, 'application/pdf', '2023-2024/109_3.1 ໄດ້ມີການເຜີຍແຜ່ວິໄສທັດໃຫ້ຄູອາຈານ, ນັກສຶກສາ ແລະ ສັງຄົມພາຍນອກໄດ້ຮັບຮູ້.pdf', '2025-06-04'),
(249, 86, '185', 'ຄວາມເພີງພໍໃຈ_1.pdf', 213256, 'application/pdf', '2023-2024/86_ຄວາມເພີງພໍໃຈ_1.pdf', '2025-06-04'),
(250, 94, '1837 ວັນທີ 6 2024', 'ບໍລິການສັງຄົມ 2024.pdf', 2377142, 'application/pdf', '2023-2024/94_ບໍລິການສັງຄົມ 2024.pdf', '2025-06-04'),
(251, 94, '1796 ວັນທີ 28 ພຶດສະພາ 2024', 'ບໍລິການສັງຄົມ ບໍລິຫານທຸລະກິດ, ໄຟຟ້າ,ອຸດສາຫະກຳ.pdf', 1354182, 'application/pdf', '2023-2024/94_ບໍລິການສັງຄົມ ບໍລິຫານທຸລະກິດ, ໄຟຟ້າ,ອຸດສາຫະກຳ.pdf', '2025-06-04'),
(252, 86, 'ຮູບພາບ', 'ແບບຟອມແບບສອບຖາມ.jpg', 62562, 'image/jpeg', '2023-2024/86_ແບບຟອມແບບສອບຖາມ.jpg', '2025-06-04'),
(253, 110, 'ເລກທີ 185 ວຕວ-ຫຼບ.ກກ, ຫຼວງພະບາງ, ວັນທີ 7/6/2024', 'ແຜນຄວາມເພິ່ງພໍໃຈ.pdf', 2546771, 'application/pdf', '2023-2024/110_ແຜນຄວາມເພິ່ງພໍໃຈ.pdf', '2025-06-09'),
(254, 110, 'ຮູບພາບ', 'ເຄື່ອງມືເກັບກຳຄວາມເພິ່ງພໍໃຈ (QR  ປະເມີນທາງອອນລາຍ).png', 455446, 'image/png', '2023-2024/110_ເຄື່ອງມືເກັບກຳຄວາມເພິ່ງພໍໃຈ (QR  ປະເມີນທາງອອນລາຍ).png', '2025-06-09'),
(255, 110, 'ແຈ້ງການເລກທີ1822 ວຕວຫຼບ ວັນທີ 31/5/2024', 'ວິທີການ ຂີດໜ້າ 3.png', 511749, 'image/png', '2023-2024/110_ວິທີການ ຂີດໜ້າ 3.png', '2025-06-09'),
(257, 110, 'ໃບລົງທະບຽນເຂົ້າຮ່ວມ', 'ວິທີການ 2 ຂີດໜ້າ 3.png', 317294, 'image/png', '2023-2024/110_ວິທີການ 2 ຂີດໜ້າ 3.png', '2025-06-09'),
(259, 110, 'ໜັງສືສະເໜີ ເລກທີ 9 ວຕວ-ຫຼບ.ກກ, ວັນທີ 5/2/2024', 'ວິທີການ 2 ຂີດໜ້າ 3.png', 317294, 'image/png', '2023-2024/110_ວິທີການ 2 ຂີດໜ້າ 3.png', '2025-06-09'),
(260, 110, 'ຂໍ້ຕົກລົງ ເລກທີ 0927 ວຕວ-ຫຼບ, ວັນທີ 15 ມີນາ 2024', 'ວິທີການ 3.png', 428889, 'image/png', '2023-2024/110_ວິທີການ 3.png', '2025-06-09'),
(261, 111, 'ເລກທີ 186 ຫຼວງພະບາງ,ວັນທີ 7/6/2024', 'ແຜນຕິດຕາມຜູ້ຮຽນຈົບ ມາຖານ 2.png', 769620, 'image/png', '2023-2024/111_ແຜນຕິດຕາມຜູ້ຮຽນຈົບ ມາຖານ 2.png', '2025-06-09'),
(262, 111, 'ແບບຟອມຕິດຕາມຂອງຜູ້ຮຽນຈົບນຳສະຖານປະກອບການ(ຜູ້ໃຊ້ແຮງງານ)', 'ແບບຟອມຕິດຕາມຜູ້ຮຽນຈົບນຳສະຖານປະກອບການ.pdf', 297379, 'application/pdf', '2023-2024/111_ແບບຟອມຕິດຕາມຜູ້ຮຽນຈົບນຳສະຖານປະກອບການ.pdf', '2025-06-09'),
(263, 111, 'ແບບເກັບກຳຕົວຈີງ', 'ແບບຟອມເກັບກຳອາດີດນັກສຶກສາ ມາດຖານ 10 ຕົວຊີ້ວັດ 2.png', 89526, 'image/png', '2023-2024/111_ແບບຟອມເກັບກຳອາດີດນັກສຶກສາ ມາດຖານ 10 ຕົວຊີ້ວັດ 2.png', '2025-06-09'),
(264, 111, 'ແບບຟອມເກັບກຳຕົວຈີງ2', 'ແບບຟອມຕິດຕາມຜູ້ຮຽນຈົບ 2.png', 60774, 'image/png', '2023-2024/111_ແບບຟອມຕິດຕາມຜູ້ຮຽນຈົບ 2.png', '2025-06-09'),
(265, 110, 'ແບບຟອມຄວາມຄິດເຫັນ', 'ແບບຟອມຄວາມຄິດເຫັນ.png', 69706, 'image/png', '2023-2024/110_ແບບຟອມຄວາມຄິດເຫັນ.png', '2025-06-09'),
(266, 112, 'ຮູບພາບ', 'ຕົວຊີວັດ3,1.pdf', 2334089, 'application/pdf', '2023-2024/112_ຕົວຊີວັດ3,1.pdf', '2025-06-09'),
(267, 113, 'ຮູບພາບ', 'ຕົວຊີວັດ 4 ມາດຖານ 10.pdf', 1392398, 'application/pdf', '2023-2024/113_ຕົວຊີວັດ 4 ມາດຖານ 10.pdf', '2025-06-09'),
(268, 112, 'ຮູບພາບ', 'ຂໍ້ຕົກລົງບໍລິການສັງຄົມ.pdf', 1354182, 'application/pdf', '2023-2024/112_ຂໍ້ຕົກລົງບໍລິການສັງຄົມ.pdf', '2025-06-09'),
(269, 112, 'ຮູບພາບ', 'ງົບປະມານບໍລິການສັງຄົມ 2024.pdf', 386610, 'application/pdf', '2023-2024/112_ງົບປະມານບໍລິການສັງຄົມ 2024.pdf', '2025-06-09'),
(270, 114, '122/ວຕວ-ຫຼບ.ບຮທ', 'ແຜນງົບປະມານ, ລາຍຮັບ, ລາຍຈ່າຍ.pdf', 5938613, 'application/pdf', '2023-2024/114_ແຜນງົບປະມານ, ລາຍຮັບ, ລາຍຈ່າຍ.pdf', '2025-06-10'),
(272, 115, '06/ຈຂ.ຫຼບ', 'ຂໍ້ຕົກລົງແຕ່ງຕັ້ງ ຫຼື ລາຍຊື່ຂອງສະມາຊິກສະພາທີ່ປຶກສາ ຫຼື ສະພາບໍລິຫານ ( ຂອງ ວຕວ ).pdf', 2203445, 'application/pdf', '2023-2024/115_ຂໍ້ຕົກລົງແຕ່ງຕັ້ງ ຫຼື ລາຍຊື່ຂອງສະມາຊິກສະພາທີ່ປຶກສາ ຫຼື ສະພາບໍລິຫານ ( ຂອງ ວຕວ ).pdf', '2025-06-10'),
(273, 116, '2218/ວຕວ-ຫຼບ', 'ແຕ່ງຕັ້ງພະນັກງານ-ຄູອາຈານເປັນສະພາວິຊາການຂອງວິທະຍາໄລ.pdf', 1187998, 'application/pdf', '2023-2024/116_ແຕ່ງຕັ້ງພະນັກງານ-ຄູອາຈານເປັນສະພາວິຊາການຂອງວິທະຍາໄລ.pdf', '2025-06-10'),
(276, 118, 'ແຜນເກັບກຳຜູ້ຮຽນຈົບ', 'ແຜນລົງເກັບກຳຄວາມເພິ່ງພໍໃຈຜູ້ຮຽນຈົບ.png', 769620, 'image/png', '2023-2024/118_ແຜນລົງເກັບກຳຄວາມເພິ່ງພໍໃຈຜູ້ຮຽນຈົບ.png', '2025-06-10'),
(277, 119, 'ການປະສານງານພົວພັນວຽກງານພາຍໃນ ແລະ ພາຍນອກ', '______2(___________6) (1).pdf', 372925, 'application/pdf', '2023-2024/119_______2(___________6) (1).pdf', '2025-06-10'),
(278, 120, 'ບົດລາຍງານການຊ່ວຍເຫຼືອສັງຄົວ ວຕວ ຫຼບ', 'ບົດລາຍງານການຊ່ວຍເຫຼືອສັງຄົມ ວຕວ ຫຼບ.pdf', 1392398, 'application/pdf', '2023-2024/120_ບົດລາຍງານການຊ່ວຍເຫຼືອສັງຄົມ ວຕວ ຫຼບ.pdf', '2025-06-10'),
(279, 119, 'ຮູບພາບ', 'ກູ່ມປະສານງານ.jpeg', 87243, 'image/jpeg', '2023-2024/119_ກູ່ມປະສານງານ.jpeg', '2025-06-10'),
(280, 121, 'ແຜນເກັບກຳ', 'ແຜນລົງເກັບກຳຄວາມເພິ່ງພໍໃຈຜູ້ຮຽນຈົບ.png', 769620, 'image/png', '2023-2024/121_ແຜນລົງເກັບກຳຄວາມເພິ່ງພໍໃຈຜູ້ຮຽນຈົບ.png', '2025-06-10'),
(281, 122, 'ຮູບພາບຫ້ອງນ້ຳ', '1.________________.pdf', 994525, 'application/pdf', '2023-2024/122_1.________________.pdf', '2025-06-10'),
(283, 122, 'ຮູບພາບປາຍສັນຍາລັກ', 'ltvcQA_10-6-2568_14-39-19.pdf', 1069112, 'application/pdf', '2023-2024/122_ltvcQA_10-6-2568_14-39-19.pdf', '2025-06-10'),
(284, 123, 'ຮູບພາບ', 'ຄວາມເຜີ່ງພໍໃຈ.pdf', 2546771, 'application/pdf', '2023-2024/123_ຄວາມເຜີ່ງພໍໃຈ.pdf', '2025-06-10'),
(285, 122, 'ການປະເມີນ', '____________.pdf', 362421, 'application/pdf', '2023-2024/122_____________.pdf', '2025-06-10'),
(286, 123, 'ຮູບພາບ', '___________________________ (QR  _______________).png', 455446, 'image/png', '2023-2024/123____________________________ (QR  _______________).png', '2025-06-10'),
(287, 118, 'ພາຍຫຼັງຮຽນຈົບ', 'ພາຍຫຼັງຮຽນຈົບ.pdf', 7184665, 'application/pdf', '2023-2024/118_ພາຍຫຼັງຮຽນຈົບ.pdf', '2025-06-10'),
(288, 119, 'ຮູບພາບ', 'ການສື່ສານ ແລະປະສານງານພາຍໃນ ແລະ ພາຍນອກສະຖານປະກອບການ.pdf', 1392398, 'application/pdf', '2023-2024/119_ການສື່ສານ ແລະປະສານງານພາຍໃນ ແລະ ພາຍນອກສະຖານປະກອບການ.pdf', '2025-06-10'),
(290, 124, '0885/ວຕວ-ຫຼບ', 'ມາດຖານ7 ຂໍ້1.jpeg', 138842, 'image/jpeg', '2023-2024/124_ມາດຖານ7 ຂໍ້1.jpeg', '2025-06-10'),
(291, 124, '0885/ວຕວ-ຫຼບ', 'ມຖ7 1.1.jpeg', 96070, 'image/jpeg', '2023-2024/124_ມຖ7 1.1.jpeg', '2025-06-10'),
(292, 115, 'ຮູບພາບ', 'ltvcQA_6-10-2025-_3-09-58_PM.pdf', 1354182, 'application/pdf', '2023-2024/115_ltvcQA_6-10-2025-_3-09-58_PM.pdf', '2025-06-10'),
(293, 115, 'ຮູບພາບ', 'ltvcQA_6-10-2025-_3-12-52_PM.pdf', 386610, 'application/pdf', '2023-2024/115_ltvcQA_6-10-2025-_3-12-52_PM.pdf', '2025-06-10'),
(294, 115, 'ຮູບພາບ', 'ມີຂໍ້ຕົກລົງແຕ່ງຕັ້ງ.pdf', 2334089, 'application/pdf', '2023-2024/115_ມີຂໍ້ຕົກລົງແຕ່ງຕັ້ງ.pdf', '2025-06-10'),
(295, 122, 'ຮູບພາບ', 'ມີລະບົບໄຟ້າໃຊ້ພຽງພໍ.pdf', 1385219, 'application/pdf', '2023-2024/122_ມີລະບົບໄຟ້າໃຊ້ພຽງພໍ.pdf', '2025-06-10'),
(296, 114, 'ຮູບພາບ', '2.3.1ແຜນງບົປະມານປະຈໍາປີ.pdf', 2754930, 'application/pdf', '2023-2024/114_2.3.1ແຜນງບົປະມານປະຈໍາປີ.pdf', '2025-06-10'),
(297, 114, 'ຮູບພາບ', '2,3,2 ແຜນງົບປະມານປະຈໍາງວດ.pdf', 923802, 'application/pdf', '2023-2024/114_2,3,2 ແຜນງົບປະມານປະຈໍາງວດ.pdf', '2025-06-10'),
(298, 115, 'ຮູບພາບ', '2,1,1ຂໍ້ຕົກລົງລາຍຊື່ສະພາທີປືກສາ.pdf', 2203445, 'application/pdf', '2023-2024/115_2,1,1ຂໍ້ຕົກລົງລາຍຊື່ສະພາທີປືກສາ.pdf', '2025-06-10'),
(299, 119, 'ຮູບພາບ', '2,6,2 ນໍ້າໃຊ້ເຄື່ອງມືທີ່ທັນສະໄໜ.jpeg', 163683, 'image/jpeg', '2023-2024/119_2,6,2 ນໍ້າໃຊ້ເຄື່ອງມືທີ່ທັນສະໄໜ.jpeg', '2025-06-10'),
(300, 120, 'ຮູບພາບ', 'ຮູບບໍລິການສັງຄົມ.zip', 171299, 'application/x-zip-compressed', '2023-2024/120_ຮູບບໍລິການສັງຄົມ.zip', '2025-06-10'),
(301, 120, 'ຮູບພາບ', 'ຮູບບໍລິການສັງຄົມ.jpeg', 94950, 'image/jpeg', '2023-2024/120_ຮູບບໍລິການສັງຄົມ.jpeg', '2025-06-10'),
(302, 115, 'ຮູບພາບ', '2,1,2 ຂໍ້ກໍານົດທີ່ຕັ້ງໜ້າທີ່ພາລະບົດບາດຂອງສະພາທີປືກສາ.pdf', 5045438, 'application/pdf', '2023-2024/115_2,1,2 ຂໍ້ກໍານົດທີ່ຕັ້ງໜ້າທີ່ພາລະບົດບາດຂອງສະພາທີປືກສາ.pdf', '2025-06-10'),
(303, 125, 'ຮູບພາບ', '1,4,1ລົງທະບຽນທົບທວນວິໄສທັດ.pdf', 632813, 'application/pdf', '2023-2024/125_1,4,1ລົງທະບຽນທົບທວນວິໄສທັດ.pdf', '2025-06-10'),
(304, 114, 'ຮູບພາບ', '2,3,4 ຈັດສັນງົບປະມານຕາມສັດສ່ວນ.pdf', 3220961, 'application/pdf', '2023-2024/114_2,3,4 ຈັດສັນງົບປະມານຕາມສັດສ່ວນ.pdf', '2025-06-10'),
(305, 114, 'ຮູບພາບ', '2,3,3 ສະຫຼຸບສູນໂມງ.pdf', 1211104, 'application/pdf', '2023-2024/114_2,3,3 ສະຫຼຸບສູນໂມງ.pdf', '2025-06-10'),
(306, 120, 'ຮູບພາບບໍລິການສັງຄົມ2', 'ຮູບພາບບໍລິການສັງຄົມ2.jpeg', 76007, 'image/jpeg', '2023-2024/120_ຮູບພາບບໍລິການສັງຄົມ2.jpeg', '2025-06-10'),
(307, 126, 'ຮູບພາບ', 'ມີການສົ່ງເສີມຫົວຄິປະດິດສ້າງ.pdf', 616685, 'application/pdf', '2023-2024/126_ມີການສົ່ງເສີມຫົວຄິປະດິດສ້າງ.pdf', '2025-06-10'),
(308, 127, 'ຮູບພາບ', '4,4,1ບັນຊີເດີນກິລາສະໂມສອນ.pdf', 4569298, 'application/pdf', '2023-2024/127_4,4,1ບັນຊີເດີນກິລາສະໂມສອນ.pdf', '2025-06-10'),
(309, 128, '4280', 'ແຜນງົບປະມານຊື້ວັດຖຸດິບ.pdf', 2235372, 'application/pdf', '2023-2024/128_ແຜນງົບປະມານຊື້ວັດຖຸດິບ.pdf', '2025-06-11'),
(310, 129, '1398 ວັນທີ 24 ເມສາ 2022', 'ກົດລະບຽບວິທະຍາໄລ.pdf', 1705557, 'application/pdf', '2023-2024/129_ກົດລະບຽບວິທະຍາໄລ.pdf', '2025-06-13'),
(313, 132, 'ຮູບພາບ', 'ACE Scanner_2025_06_17(2).pdf', 6186687, 'application/pdf', '2023-2024/132_ACE Scanner_2025_06_17(2).pdf', '2025-06-17'),
(315, 133, 'ຮູບພາບ', 'ACE Scanner_2025_06_17(4).pdf', 2016556, 'application/pdf', '2023-2024/133_ACE Scanner_2025_06_17(4).pdf', '2025-06-17'),
(316, 133, 'ຮູບພາບ', 'ACE Scanner_2025_06_17(3).pdf', 739389, 'application/pdf', '2023-2024/133_ACE Scanner_2025_06_17(3).pdf', '2025-06-17'),
(317, 130, 'ຮູບພາບ', 'ACE Scanner_2025_06_17.pdf', 2167494, 'application/pdf', '2023-2024/130_ACE Scanner_2025_06_17.pdf', '2025-06-17'),
(318, 130, 'ຮູບພາບ', 'ACE Scanner_2025_06_17(1).pdf', 1693688, 'application/pdf', '2023-2024/130_ACE Scanner_2025_06_17(1).pdf', '2025-06-17'),
(320, 134, 'ຮູບພາບ', 'ACE Scanner_2025_06_17(5).pdf', 1350562, 'application/pdf', '2023-2024/134_ACE Scanner_2025_06_17(5).pdf', '2025-06-17'),
(321, 135, 'ຮູບພາບ', 'ACE Scanner_2025_06_17(6).pdf', 1790331, 'application/pdf', '2023-2024/135_ACE Scanner_2025_06_17(6).pdf', '2025-06-17'),
(322, 136, 'ຮູບພາບ', 'ACE Scanner_2025_06_17(7).pdf', 1766918, 'application/pdf', '2023-2024/136_ACE Scanner_2025_06_17(7).pdf', '2025-06-17'),
(323, 136, 'ຮູບພາບ', 'ACE Scanner_2025_06_17(8).pdf', 2896382, 'application/pdf', '2023-2024/136_ACE Scanner_2025_06_17(8).pdf', '2025-06-17'),
(324, 136, 'ຮູບພາບ', 'ACE Scanner_2025_06_17(9).pdf', 1360753, 'application/pdf', '2023-2024/136_ACE Scanner_2025_06_17(9).pdf', '2025-06-17'),
(325, 137, 'ບໍ່ມີ', 'ແບບຟອມສອບຖາມຄວາມເພິ່ງພໍໃຈຂອງນັກສຶກສາ.pdf', 5883643, 'application/pdf', '2023-2024/137_ແບບຟອມສອບຖາມຄວາມເພິ່ງພໍໃຈຂອງນັກສຶກສາ.pdf', '2025-06-25'),
(326, 138, '1837 ວັນທີ່ 03 ມີຖຸນາ 2024', 'ບໍລິການສັງຄົມ2024.pdf', 2377140, 'application/pdf', '2023-2024/138_ບໍລິການສັງຄົມ2024.pdf', '2025-06-25'),
(327, 138, '2506 ວັນທີ 26 ເດືອນ07 ກໍລະກົດ 2024', 'ແນະແນວວິຊາຊີບ 2023-2024.pdf', 6560055, 'application/pdf', '2023-2024/138_ແນະແນວວິຊາຊີບ 2023-2024.pdf', '2025-06-25'),
(328, 139, '0927 ວັນທີ່ 15 ມີນາ 2024', 'ຄວາມເພີ່ງພໍໃຈຂອງຜູ້ໃຊ້ແຮງງານແລະຜູ້ຮຽນຈົບຕາມຜົນການຮຽນຂອງຫຼັກສ.pdf', 9919776, 'application/pdf', '2023-2024/139_ຄວາມເພີ່ງພໍໃຈຂອງຜູ້ໃຊ້ແຮງງານແລະຜູ້ຮຽນຈົບຕາມຜົນການຮຽນຂອງຫຼັກສ.pdf', '2025-06-26'),
(329, 140, '1822 ວັນທີ່ 31  ພຶດສະພາ 2024', 'ຜູ້ຮຽນມີຄວາມເພີ່ງພໍໃຈໂດຍລວມຕໍ່ການບໍລິການຂອງສະຖານການສຶກສາມີ.pdf', 4685856, 'application/pdf', '2023-2024/140_ຜູ້ຮຽນມີຄວາມເພີ່ງພໍໃຈໂດຍລວມຕໍ່ການບໍລິການຂອງສະຖານການສຶກສາມີ.pdf', '2025-06-26'),
(330, 141, 'ເລກທີ 3343 ວັນທີ 31ຕຸລາ 2023', '8c36b396-4863-4619-97a2-7e8eae01f4c4.pdf', 354288, 'application/pdf', '2023-2024/141_8c36b396-4863-4619-97a2-7e8eae01f4c4.pdf', '2025-06-30'),
(331, 142, 'ເລກທີ 1987ວັນທີ 13 ມິຖຸນາ 2024', '1 (1).pdf', 406116, 'application/pdf', '2023-2024/142_1 (1).pdf', '2025-06-30'),
(332, 143, '7304 ວັນທີ 21 ທັນວາ 2022', 'ຊ່າງເຟີນີເຈີຊັ້ນສູງ (1).pdf', 2953360, 'application/pdf', '2023-2024/143_ຊ່າງເຟີນີເຈີຊັ້ນສູງ (1).pdf', '2025-06-30'),
(333, 143, 'ບໍ່ມີເລກທີ', 'ຫຼັກສູດກໍ່-ໂບກອາຄານ Final.pdf', 3286525, 'application/pdf', '2023-2024/143_ຫຼັກສູດກໍ່-ໂບກອາຄານ Final.pdf', '2025-06-30'),
(334, 144, 'ຮູບພາບ', 'CamScanner 04-06-2025 09.33.pdf', 235835, 'application/pdf', '2023-2024/144_CamScanner 04-06-2025 09.33.pdf', '2025-07-03'),
(335, 144, 'ຮູບພາບ', 'CamScanner 04-06-2025 09.35.pdf', 341636, 'application/pdf', '2023-2024/144_CamScanner 04-06-2025 09.35.pdf', '2025-07-03'),
(336, 144, 'ບໍ່ມີເລກທີ', 'CamScanner 03-06-2025 15.32.pdf', 1048770, 'application/pdf', '2023-2024/144_CamScanner 03-06-2025 15.32.pdf', '2025-07-03'),
(337, 144, 'ຮູບພາບ', 'CamScanner 04-06-2025 09.38.pdf', 458014, 'application/pdf', '2023-2024/144_CamScanner 04-06-2025 09.38.pdf', '2025-07-03'),
(338, 144, 'ຮູບພາບ', 'CamScanner 04-06-2025 09.39.pdf', 669145, 'application/pdf', '2023-2024/144_CamScanner 04-06-2025 09.39.pdf', '2025-07-03'),
(339, 104, '145 ວັນທີ 9 ມັງກອນ 2024', 'ຝຶກອົບຮົມບາລິສຕາ.pdf', 996000, 'application/pdf', '2023-2024/104_ຝຶກອົບຮົມບາລິສຕາ.pdf', '2025-07-11'),
(340, 129, 'ຮູບພາບ', 'ປ້າຍສັນຍາລັກເຄື່ອງໝາຍ.pdf', 897470, 'application/pdf', '2023-2024/129_ປ້າຍສັນຍາລັກເຄື່ອງໝາຍ.pdf', '2025-07-11'),
(341, 145, '436ວັນທີ່31 ມີຖຸນາ 2025', 'ບຸນສະຫຼຸບປະຈໍາປີສົກ2023-2024.pdf', 8272567, 'application/pdf', '2023-2024/145_ບຸນສະຫຼຸບປະຈໍາປີສົກ2023-2024.pdf', '2025-09-02'),
(343, 147, '187/7/6/2024', 'ແຜນການເກັບກຳຂໍ້ມູນອາດິດນັກສຶກສາປະຈໍາສົກຮຽນ2023-2024.pdf', 2314713, 'application/pdf', '2023-2024/147_ແຜນການເກັບກຳຂໍ້ມູນອາດິດນັກສຶກສາປະຈໍາສົກຮຽນ2023-2024.pdf', '2025-09-18'),
(344, 146, '233/17/72024', 'ສັງລວມການຕິດຕາມນັກສຶກສາຮຽນຈົບໃນສົກ2023-2024.pdf', 3747133, 'application/pdf', '2023-2024/146_ສັງລວມການຕິດຕາມນັກສຶກສາຮຽນຈົບໃນສົກ2023-2024.pdf', '2025-09-18'),
(345, 146, '257/12/8/2024', 'ຕິດຕາມອາດິດນັກສຶກສາc1ຊຸດທີ່1ສາຂາຜູ້ຊວ່ຍຄົວ.pdf', 1803017, 'application/pdf', '2023-2024/146_ຕິດຕາມອາດິດນັກສຶກສາc1ຊຸດທີ່1ສາຂາຜູ້ຊວ່ຍຄົວ.pdf', '2025-09-18'),
(346, 146, '242/25/7/2025', 'ຕິດຕາມອາດິດນັກສຶກສາc1ຊຸດ2ສາຂາພະນັກງານເສີບ.pdf', 1654075, 'application/pdf', '2023-2024/146_ຕິດຕາມອາດິດນັກສຶກສາc1ຊຸດ2ສາຂາພະນັກງານເສີບ.pdf', '2025-09-18'),
(347, 146, '421/25/7/2025', 'ຕິດຕາມອາດິດນັກສຶກສາc1ຊຸດທີ່2ປຸງແຕ່ງອາຫານລາວ.pdf', 1830816, 'application/pdf', '2023-2024/146_ຕິດຕາມອາດິດນັກສຶກສາc1ຊຸດທີ່2ປຸງແຕ່ງອາຫານລາວ.pdf', '2025-09-18'),
(348, 146, '187/7/6/2024', 'ແຜນການເກັບກຳຂໍ້ມູນອາດິດນັກສຶກສາປະຈໍາສົກຮຽນ2023-2024.pdf', 2314713, 'application/pdf', '2023-2024/146_ແຜນການເກັບກຳຂໍ້ມູນອາດິດນັກສຶກສາປະຈໍາສົກຮຽນ2023-2024.pdf', '2025-09-18'),
(349, 148, '4625/10/12/2024', 'ຂໍ້ຕົກລົງຮັບຜິດຊອບຕຳແໜ່ງວິຊາການຂອງວຕວr 10-12-2024 09.40.pdf', 1566837, 'application/pdf', '2023-2024/148_ຂໍ້ຕົກລົງຮັບຜິດຊອບຕຳແໜ່ງວິຊາການຂອງວຕວr 10-12-2024 09.40.pdf', '2025-09-19'),
(350, 148, '2186/27/6/2024', '01.ຂໍ້ຕົກລົງວ່າດ້ວຍການຄົ້ນຄວ້າວິໄຈ, ຮຽບຮຽງ, ແປຕໍາລາ, ສ້າງສິ່ງປະດິດ ແລະ ຂໍຕໍາແໜ່ງວິຊາການຂອງວຕວ.pdf', 358129, 'application/pdf', '2023-2024/148_01.ຂໍ້ຕົກລົງວ່າດ້ວຍການຄົ້ນຄວ້າວິໄຈ, ຮຽບຮຽງ, ແປຕໍາລາ, ສ້າງສິ່ງປະດິດ ແລະ ຂໍຕໍາແໜ່ງວິຊາການຂອງວຕວ.pdf', '2025-09-19'),
(351, 148, '0192/11/1/2024', 'ຂໍ້ຕົກລົງສະພາວິຊາການ.pdf', 4553859, 'application/pdf', '2023-2024/148_ຂໍ້ຕົກລົງສະພາວິຊາການ.pdf', '2025-09-19'),
(353, 149, '1837/3/6/2024', 'ຂໍ້ຕົກລົງຮັບຜິດຊອບຕຳແໜ່ງວິຊາການຂອງວຕວr 10-12-2024 09.40.pdf', 1566837, 'application/pdf', '2023-2024/149_ຂໍ້ຕົກລົງຮັບຜິດຊອບຕຳແໜ່ງວິຊາການຂອງວຕວr 10-12-2024 09.40.pdf', '2025-09-19'),
(354, 149, '1796/28/5/2024', '01.ຂໍ້ຕົກລົງວ່າດ້ວຍການຄົ້ນຄວ້າວິໄຈ, ຮຽບຮຽງ, ແປຕໍາລາ, ສ້າງສິ່ງປະດິດ ແລະ ຂໍຕໍາແໜ່ງວິຊາການຂອງວຕວ.pdf', 358129, 'application/pdf', '2023-2024/149_01.ຂໍ້ຕົກລົງວ່າດ້ວຍການຄົ້ນຄວ້າວິໄຈ, ຮຽບຮຽງ, ແປຕໍາລາ, ສ້າງສິ່ງປະດິດ ແລະ ຂໍຕໍາແໜ່ງວິຊາການຂອງວຕວ.pdf', '2025-09-19');

-- --------------------------------------------------------

--
-- Table structure for table `tb_indicator`
--

CREATE TABLE IF NOT EXISTS `tb_indicator` (
`IndicatorID` int(11) NOT NULL,
  `standardID` int(11) NOT NULL,
  `IndicatorName` varchar(255) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=55 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `tb_indicator`
--

INSERT INTO `tb_indicator` (`IndicatorID`, `standardID`, `IndicatorName`) VALUES
(1, 1, 'ຕົວຊີ້ວັດທີ 1 : ວິໄສທັດ ແລະ ພາລະກິດ ໄດ້ຖືກກຳນົດ ໂດຍສອດຄ່ອງກັບ ຄວາມຮຽກຮ້ອງຕ້ອງການຂອງທ້ອງຖິ່ນ ແລະ ຂະແໜງການ.'),
(2, 1, 'ຕົວຊີ້ວັດທີ 2 : ວິໄສທັດ ແລະ ພາລະກິດ ໄດ້ຖືກຜັນຂະຫຍາຍເຂົ້າໃນ ການຈັດຕັ້ງປະຕິບັດ (ແຜນຍຸດທະສາດ, ແຜນພັດທະນາ, ແຜນງານ ແລະ ໂຄງການຕ່າງໆ) ແລະ ມີຈຸດໝາຍ ໃນແຕ່ລະໄລຍະ.'),
(3, 1, 'ຕົວຊີ້ວັດທີ 3 : ພາລະກິດ, ວິໄສທັດ ແລະ ແຜນການຕ່າງໆ ໄດ້ຖືກເຜີຍແຜ່ໃຫ້ທຸກພາກສ່ວນ ທັງພາຍໃນສະຖານອາຊີວະສຶກສາ ແລະ ສັງຄົມອ້ອມຂ້າງ ໄດ້ຮັບຮູ້ ແລະ ສາມາດເຂົ້າເຖິງໄດ້.'),
(4, 1, 'ຕົວຊີ້ວັດທີ 4 : ການຈັດຕັ້ງປະຕິບັດວິໄສທັດ, ພາລະກິດ ແລະ ແຜນການຕ່າງໆ ໄດ້ຖືກທົບທວນ ແລະ ມີການຖອດຖອນບົດຮຽນ ໃນແຕ່ລະໄລຍະ. '),
(5, 2, 'ຕົວຊີ້ວັດທີ 1 : ສະພາທີ່ປຶກສາ, ສະພາວິຊາການ ແລະ ສະພາຄູມີອົງປະກອບ ແລະ ຊັດສ່ວນສະມາຊິກທີ່ເໝາະສົມ ແລະ ເຄື່ອນໄຫວວຽກງານ ຕາມພາລະບົດບາດ ຢ່າງເປັນຮູບປະທໍາ.'),
(6, 2, 'ຕົວຊີ້ວັດທີ 2 : ຄະນະຜູ້ບໍລິຫານ ເຄື່ອນໄຫວວຽກງານຕາມຫຼັກການລວມສູນປະຊາທິປະໄຕ ແລະ ຕົກລົງເປັນໝູ່ຄະນະ ຢ່າງເຂັ້ມງວດ.'),
(7, 2, 'ຕົວຊີ້ວັດທີ 3 : ການສ້າງແຜນ ແລະ ນຳໃຊ້ ງົບປະມານ ລວມທັງລາຍຮັບວິຊາການມີອັດຕາສ່ວນສອດຄ່ອງຕາມແຜນພັດທະນາ ແລະ ລະບຽບ-ຫຼັກການ.'),
(8, 2, 'ຕົວຊີ້ວັດທີ 4 : ຂໍ້ແນະນໍາ ຈາກການປະກັນຄຸນນະພາບການສຶກສາ (ການປະເມີນຕົນເອງ, ພາຍໃນ ແລະ ພາຍນອກ) ໄດ້ຖືກນໍາໃຊ້ ເຂົ້າໃນການສ້າງແຜນພັດທະນາ ແລະ ມີການປັບປຸງຄຸນນະພາບຢ່າງຕໍ່ເນື່ອງ.'),
(9, 2, 'ຕົວຊີ້ວັດທີ 5 : ມີລະບົບໃນການບໍລິຫານເອກະສານຂາອອກ-ຂາເຂົ້າ ເພື່ອຮັບປະກັນຄວາມປອດໄພ, ວ່ອງໄວ ແລະ ທັນສະໄໝ.'),
(10, 2, 'ຕົວຊີ້ວັດທີ 6 : ການສື່ສານ ແລະ ປະສານງານ ພາຍໃນ ມີຂັ້ນຕອນ-ກົນໄກ ຈະແຈ້ງ ອໍານວຍຄວາມສະດວກໃຫ້ການຈັດຕັ້ງປະຕິບັດວຽກງານຕ່າງໆ.'),
(11, 3, 'ຕົວຊີ້ວັດທີ 1 : ບຸກຄະລາກອນ ມີຈໍານວນພຽງພໍ ແລະ ສອດຄ່ອງ ຕາມຕໍາແໜ່ງງານ.'),
(12, 3, 'ຕົວຊີ້ວັດທີ 2 : ຄູສອນ ມີວຸດທິ, ວິຊາສະເພາະ ແລະ ປະສົບການທີ່ເໝາະສົມກັບວິຊາທີ່ສອນ ແລະ ຫຼັກສູດທີ່ເປີດສອນ.'),
(17, 3, 'ຕົວຊີ້ວັດທີ 3 : ຄູສອນ ຖືກສົ່ງເສີມວິຊາສະເພາະໃດໜຶ່ງ ໃຫ້ ມີປະສົບການໃນວຽກງານຕົວຈິງພາຍໃນສະຖານອາຊີວະສຶກສາ ແລະ ສະຖານປະກອບການ ຫຼື ພາກທຸລະກິດອື່ນໆ.'),
(18, 3, 'ຕົວຊີ້ວັດທີ 4 : ບຸກຄະລາກອນ ໄດ້ຮັບການສົ່ງເສີມ ຍົກລະດັບພາສາຕ່າງປະເທດ ແລະ ທັກສະທາງໄອຊີທີ. '),
(19, 3, 'ຕົວຊີ້ວັດທີ 5 : ການປະເມີນບຸກຄະລາກອນ ໄດ້ດໍາເນີນການຕາມລະບຽບຫຼັກການ, ມີການຍ້ອງຍໍ ຫຼື ປະຕິບັດມາດຕະການຕ່າງໆ ຢ່າງເປັນປົກກະຕິ.'),
(20, 4, 'ຕົວຊີ້ວັດທີ 1 : ສິ່ງອຳນວຍຄວາມສະດວກ ຂັ້ນພື້ນຖານ ສາມາດນຳໃຊ້ໄດ້.'),
(21, 4, 'ຕົວຊີ້ວັດທີ 2 : ສິ່ງອໍານວຍຄວາມສະດວກ ໃນການຈັດການຮຽນການສອນ ມີຄວາມພຽງພໍ ແລະ ເໝາະສົມ.'),
(22, 4, 'ຕົວຊີ້ວັດທີ 3 : ວັດຖຸຄົງທີ່ ໃນການຝຶກປະຕິບັດ ມີຄວາມພຽງພໍ ແລະ ເໝາະສົມ.'),
(23, 4, 'ຕົວຊີ້ວັດທີ 5 : ວັດຖຸດິບ ຫຼື ວັດຖຸນຳໃຊ້ປະຈຳວັນ ມີຄວາມພຽງພໍ ແລະ ເໝາະສົມ.'),
(24, 4, 'ຕົວຊີ້ວັດທີ 4 : ສິ່ງອໍານວຍຄວາມສະດວກ ໃນການຈັດກິດຈະກໍານອກຫຼັກສູດ, ພາລະສຶກສາ ແລະ ສິລະປະສຶກສາ ມີຄວາມພຽງພໍ ແລະ ເໝາະສົມ.'),
(25, 5, 'ຕົວຊີ້ວັດທີ 1 : ປຶ້ມຕຳລາຮຽນ, ວາລະສານ, ບົດຄົ້ນຄວ້າ ແລະ ອື່ນໆ ພຽງພໍ ແລະ ທັນກັບສະພາບການ, ສາມາດເຂົ້າເຖິງດ້ວຍຫຼາຍຮູບແບບ ພ້ອມທັງມີການ ທົບທວນຄວາມເໝາະສົມ ແລະ ຄວາມສອດຄ່ອງ ຕາມແຜນທີ່ກຳນົດໄວ້.'),
(26, 5, 'ຕົວຊີ້ວັດທີ 2 : ມີເຄື່ອງປະຈັກຕາ ເຊັ່ນ ອຸປະກອນ, ເຄື່ອງຈັກ, ເຄື່ອງມືພຽງພໍ ແລະ ເໝາະສົມ ກັບ ການສອນພາກປະຕິບັດຕົວຈິງ ພ້ອມທັງມີການ ປັບປຸງ ແລະ ບຳລຸງຮັກສາ ໃຫ້ສາມາດນຳໃຊ້ໄດ້, ປອດໄພ ແລະ ທັນສະໄໝ/ທັນສະພາບ.'),
(27, 5, 'ຕົວຊີ້ວັດທີ 3 : ມີອິນເຕີເນັດ ຕອບສະໜອງໃຫ້ແກ່ການຮຽນການສອນ ແລະ ການຊອກຄົ້ນຂໍ້ມູນ ໄດ້ຢ່າງພຽງພໍ.'),
(28, 6, 'ຕົວຊີ້ວັດທີ 1 : ຄູສອນມີຊຸດການສອນ ຢ່າງຄົບຖ້ວນ ໄດ້ຮັບການທົບທວນ ແລະ ປັບປຸງ ເປັນແຕ່ລະໄລຍະ ເພື່ອໃຫ້ທັນກັບສະພາບການປ່ຽນແປງ.'),
(29, 6, 'ຕົວຊີ້ວັດທີ 2 : ມີການສ້າງ ແລະ ນໍາໃຊ້ ສື່ການຮຽນການສອນ ຫຼື ສື່ທັນສະໄໝອື່ນໆ ເຂົ້າໃນການຮຽນການສອນ.'),
(30, 6, 'ຕົວຊີ້ວັດທີ 3 : ຄູສອນ ມີທັກສະ ແລະ ຄວາມຊຳນານ ໃນການນຳໃຊ້ ອຸປະກອນ, ເຄື່ອງມື, ເຄື່ອງຈັກ ແລະ ວັດສະດຸ ເຂົ້າໃນການສອນ.'),
(31, 6, 'ຕົວຊີ້ວັດທີ 4 : ຄູສອນ ສົ່ງເສີມ ໃຫ້ຜູ້ຮຽນມີທັກສະ ຮຽນຮູ້ດ້ວຍໂຕເອງ.'),
(32, 6, 'ຕົວຊີ້ວັດທີ 5 : ຜົນການຮຽນໄດ້ຖືກປະເມີນ ຕາມມາດຕະຖານຜົນການຮຽນຂອງໂມດູນ ຫຼື ລາຍວິຊາ.'),
(33, 6, 'ຕົວຊີ້ວັດທີ 6 : ມີກົນໄກການຕິດຕາມ ການຂຶ້ນຫ້ອງສອນຂອງຄູ ແລະ ການຮ່ວມໂມງສອນ ເພື່ອປະເມີນຜົນການສອນ ແລະ ຊຸກຍູ້ຊ່ວຍເຫຼືອ. '),
(34, 7, 'ຕົວຊີ້ວັດທີ 1 : ຜູ້ຮຽນ ສາມາດເຂົ້າເຖິງການໃຫ້ຄໍາປຶກສາທາງດ້ານການຮຽນ, ການດໍາລົງຊີວິດ ແລະ ການປະກອບອາຊີບ.'),
(35, 7, 'ຕົວຊີ້ວັດທີ 2 : ຜູ້ຮຽນຖືກສົ່ງເສີມໃນທັກສະ  ການເປັນຜູ້ປະກອບການ ຫຼື ການປະກອບອາຊີບ.'),
(36, 7, 'ຕົວຊີ້ວັດທີ 3 : ຜູ້ຮຽນ ຖືກສົ່ງເສີມໃນທັກສະທາງສັງຄົມ ເປັນຕົ້ນແມ່ນ ທັກສະການສື່ສານ, ການປະສານງານ, ການເຮັດວຽກເປັນທີມ ແລະ ອື່ນໆ.'),
(37, 7, 'ຕົວຊີ້ວັດທີ 4 : ຜູ້ຮຽນ ໄດ້ຮັບການແນະນໍາທາງດ້ານສຸຂະອານາໄມ ແລະ ຄວາມປອດໄພໃນວິຊາຊີບທີ່ຮຽນຢູ່.'),
(38, 8, 'ຕົວຊີ້ວັດທີ 1 : ມີເຄືອຂ່າຍ ແລະ ກິດຈະກໍາຮ່ວມກັບສະຖານປະກອບການ ເພື່ອສົ່ງເສີມໃຫ້ຜູ້ຮຽນທີ່ຈະຈົບໄປ ມີວຽກເຮັດງານທໍາ.'),
(39, 8, 'ຕົວຊີ້ວັດທີ 2 : ມີການຮ່ວມມືກັບສະຖານປະກອບການ ໃນການຝຶກປະຕິບັດງານ ຫຼື ການຮຽນການສອນແບບຄວບຄູ່.'),
(40, 8, 'ຕົວຊີ້ວັດທີ 3 : ມີການຮ່ວມມືກັບສະຖານປະກອບການ ເພື່ອທົບທວນຫຼັກສູດ.'),
(41, 8, 'ຕົວຊີ້ວັດທີ 4 : ມີການຮ່ວມມືກັບສະຖານອາຊີວະສຶກສາອື່ນ ຫຼື ເຄືອຂ່າຍປະກັນຄຸນນະພາບ ເພື່ອສົ່ງເສີມວິຊາການຂອງຄູສອນ ແລະ ພັດທະນາທັກສະວິຊາຊີບ.'),
(42, 9, 'ຕົວຊີ້ວັດທີ 1 : ອັດຕາການມີວຽກເຮັດງານທຳຂອງຜູ້ຮຽນຈົບ ພາຍໃນໄລຍະ 6 ເດືອນ ພາຍຫຼັງຮຽນຈົບ ມີທ່າອ່ຽງເພີ່ມຂຶ້ນພ້ອມທັງເກັບຮັກສາໄວ້ຢ່າງປອດໄພ.'),
(43, 12, 'ຜູ້ຮຽນມີຄວາມເພີ່ງພໍໃຈຕໍ່ສາຂາວິຊາຮຽນ'),
(44, 12, 'ມີເຄືອຂ່າຍເພື່ອສົ່ງເສີມໃຫ້ຜູ້ຮຽນທີ່ຈະຈົບໄປມີວຽກເຮັດງານທຳຫຼືສືບຕໍ່ການຮຽນໃນລະດັບທີ່ສູງຂຶ້ນ.'),
(45, 12, 'ມີລະບົບຕິດຕາມ ແລະ ເກັບກຳຄວາມເພິ່ງພໍໃຈຂອງຜູ້ຮຽນຈົບ ແລະ ຜູ້ຈ້າງງານ.'),
(48, 9, 'ຕົວຊີ້ວັດທີ 2 : ມີຖານຂໍ້ມູນກ່ຽວກັບ ຜູ້ຮຽນຈົບ (ອາຊີບ, ຕຳແໜ່ງ ແລະ ບ່ອນເຮັດວຽກ).'),
(49, 9, 'ຕົວຊີ້ວັດທີ 3 : ມີການສົ່ງເສີມຫົວຄິດປະດິດສ້າງ ຫຼື ການສ້າງຜະລິດຕະພັນຕ່າງໆ ທີ່ຕິດພັນກັບວິຊາສະເພາະ.'),
(50, 9, 'ຕົວຊີ້ວັດທີ 4 : ມີໂຄງການສ້າງລາຍຮັບວິຊາການ ຕິດພັນກັບວິຊາສະເພາະ ແລະ ການບໍລິການສັງຄົມ.'),
(51, 10, 'ຕົວຊີ້ວັດທີ 1 : ຜູ້ຮຽນ ມີຄວາມເພິ່ງພໍໃຈໂດຍລວມ ຕໍ່ການບໍລິການຂອງສະຖານອາຊີວະສຶກສາ.'),
(52, 10, 'ຕົວຊີ້ວັດທີ 2 : ມີລະບົບ ຕິດຕາມ ແລະ ເກັບກຳ ຄວາມເພິ່ງພໍໃຈ ຂອງຜູ້ໃຊ້ແຮງງານ ແລະ ຜູ້ຮຽນຈົບ ຕາມຜົນການຮຽນຂອງຫຼັກສູດ.'),
(53, 10, 'ຕົວຊີ້ວັດທີ 3 : ມີການໂຄສະນາປະຊາສຳພັນ ແລະ ຊ່ວຍເຫຼືອສັງຄົມ.'),
(54, 10, 'ຕົວຊີ້ວັດທີ 4 : ມີບົດສັງລວມຫຍໍ້ປະຈໍາປີ (Annual School Profile) ແລະ ສາມາດເຂົ້າເຖິງໄດ້.');

-- --------------------------------------------------------

--
-- Table structure for table `tb_reportqa`
--

CREATE TABLE IF NOT EXISTS `tb_reportqa` (
`reportID` int(11) NOT NULL,
  `userID` int(11) NOT NULL,
  `IndicatorID` int(11) NOT NULL,
  `YearID` int(11) NOT NULL,
  `goodPoint` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL COMMENT 'ຈຸດດີ',
  `remainPoint` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL COMMENT 'ຂໍ້ຄົງຄ້າງ',
  `Proposal` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL COMMENT 'ຂໍ້ສະເໜີ',
  `score` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL COMMENT 'ເກນປະເມີນ',
  `assessor` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL COMMENT 'ຜູ້ປະເມີນ'
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `tb_standard`
--

CREATE TABLE IF NOT EXISTS `tb_standard` (
`standardID` int(11) NOT NULL,
  `standardName` varchar(255) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `tb_standard`
--

INSERT INTO `tb_standard` (`standardID`, `standardName`) VALUES
(1, 'ວິໄສທັດ ແລະ ພາລະກິດ'),
(2, 'ການຄຸ້ມຄອງ-ບໍລິຫານ'),
(3, 'ບຸກຄະລາກອນ '),
(4, 'ສິ່ງອຳນວຍຄວາມສະດວກ'),
(5, 'ແຫຼ່ງຮຽນຮູ້'),
(6, 'ການຈັດການຮຽນການສອນ'),
(7, 'ການສົ່ງເສີມຜູ້ຮຽນ'),
(8, 'ການຮ່ວມມືກັບພາຍນອກ'),
(9, 'ໝາກຜົນການຈັດຕັ້ງປະຕິບັດ'),
(10, 'ການໂຄສະນາປະຊາສໍາພັນ');

-- --------------------------------------------------------

--
-- Table structure for table `tb_user`
--

CREATE TABLE IF NOT EXISTS `tb_user` (
`userID` int(11) NOT NULL,
  `departmentID` int(11) NOT NULL,
  `userName` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `password` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `rule` int(11) NOT NULL DEFAULT '0',
  `log` varchar(255) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=15 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `tb_user`
--

INSERT INTO `tb_user` (`userID`, `departmentID`, `userName`, `password`, `rule`, `log`) VALUES
(1, 2, 'admin', '$2b$10$LcpT/sfCgYEb7W4Yx128IeB5hAGFcB6imJlpDo.dLY/BqMj5Xe1wu', 1, '00:00:00'),
(5, 2, 'QA02@gmail', '$2b$10$w6LJhZDnzhXn27h3OYoP7ulAorLTWXMXDrdyI59r.Hvq/I/bVrTty', 0, 'Mon Feb 06 2023 07:56:55 GMT+0700 (Indochina Time)'),
(6, 1, 'QA01@gmail', '$2b$10$tHgO9Mwt2zf0OlMfVjXG1u/O6v5JMPNyA8u1l3yLp4RDP0I7F7YEq', 0, '00.00.00'),
(7, 3, 'QA03@gmail', '$2b$10$6WztsWD7MnAkMuW3sEyiMOV0VMtf/cY31Wr/qKyJLYvmTTtH2dSDG', 0, 'Mon Feb 06 2023 07:57:38 GMT+0700 (Indochina Time)'),
(8, 4, 'QA04@gmail', '$2b$10$KKngjqoqppGcaC/fCP9Ee.qAsEowyXefGju9GQsOkvXMVdZYG/dny', 0, 'Mon Feb 06 2023 07:58:15 GMT+0700 (Indochina Time)'),
(9, 5, 'QA05@gmail', '$2b$10$9GHNYMg7VPlWDC1wEPtP8eJl2/MlJVN/kQUqzF4Y8BA9VWOlfW8jC', 0, '00.00.00'),
(10, 6, 'QA06@gmail', '$2b$10$hMFTpaGbo6cZW1hM5NvXqeXZ.hj9v.2P9URO7wfOizEqqSFhaB4Gm', 0, '00.00.00'),
(11, 7, 'QA07@gmail', '$2b$10$ihpvvutUn0HByS/P1Uxh4e.id4Lppn8cy/MZZCo6k6S4R9Lroyhle', 0, '00.00.00'),
(12, 8, 'QA08@gmail', '$2b$10$1c84ZR9jk9jHhH/0GCCVEOq.2TONcqIU0UKo8eEhBQdcULg54Xi3e', 0, '00.00.00'),
(13, 9, 'QA09@gmail', '$2b$10$CLr1m5pfhZrhpG2miD30WO5RNXQKlAAmKju0LxXv8ubriamK1Pp7O', 0, '00.00.00'),
(14, 1, 'a', 'a', 0, '');

-- --------------------------------------------------------

--
-- Table structure for table `tb_year`
--

CREATE TABLE IF NOT EXISTS `tb_year` (
`yearID` int(11) NOT NULL,
  `YearName` varchar(255) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `tb_year`
--

INSERT INTO `tb_year` (`yearID`, `YearName`) VALUES
(1, '2023-2024');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `tb_basismain`
--
ALTER TABLE `tb_basismain`
 ADD PRIMARY KEY (`basisMainID`);

--
-- Indexes for table `tb_department`
--
ALTER TABLE `tb_department`
 ADD PRIMARY KEY (`departmentID`);

--
-- Indexes for table `tb_document`
--
ALTER TABLE `tb_document`
 ADD PRIMARY KEY (`documentID`);

--
-- Indexes for table `tb_file`
--
ALTER TABLE `tb_file`
 ADD PRIMARY KEY (`fileID`);

--
-- Indexes for table `tb_indicator`
--
ALTER TABLE `tb_indicator`
 ADD PRIMARY KEY (`IndicatorID`);

--
-- Indexes for table `tb_reportqa`
--
ALTER TABLE `tb_reportqa`
 ADD PRIMARY KEY (`reportID`);

--
-- Indexes for table `tb_standard`
--
ALTER TABLE `tb_standard`
 ADD PRIMARY KEY (`standardID`);

--
-- Indexes for table `tb_user`
--
ALTER TABLE `tb_user`
 ADD PRIMARY KEY (`userID`);

--
-- Indexes for table `tb_year`
--
ALTER TABLE `tb_year`
 ADD PRIMARY KEY (`yearID`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `tb_basismain`
--
ALTER TABLE `tb_basismain`
MODIFY `basisMainID` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=307;
--
-- AUTO_INCREMENT for table `tb_department`
--
ALTER TABLE `tb_department`
MODIFY `departmentID` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=10;
--
-- AUTO_INCREMENT for table `tb_document`
--
ALTER TABLE `tb_document`
MODIFY `documentID` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=150;
--
-- AUTO_INCREMENT for table `tb_file`
--
ALTER TABLE `tb_file`
MODIFY `fileID` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=355;
--
-- AUTO_INCREMENT for table `tb_indicator`
--
ALTER TABLE `tb_indicator`
MODIFY `IndicatorID` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=55;
--
-- AUTO_INCREMENT for table `tb_reportqa`
--
ALTER TABLE `tb_reportqa`
MODIFY `reportID` int(11) NOT NULL AUTO_INCREMENT;
--
-- AUTO_INCREMENT for table `tb_standard`
--
ALTER TABLE `tb_standard`
MODIFY `standardID` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=11;
--
-- AUTO_INCREMENT for table `tb_user`
--
ALTER TABLE `tb_user`
MODIFY `userID` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=15;
--
-- AUTO_INCREMENT for table `tb_year`
--
ALTER TABLE `tb_year`
MODIFY `yearID` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=2;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
